Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_MCFG12 : (MATRIX Offset: 0x30) (R/W 32) Master Configuration Register 12 -------- */
#define MATRIX_MCFG12_ULBT_Pos                _U_(0)                                               /**< (MATRIX_MCFG12) Undefined Length Burst Type Position */
#define MATRIX_MCFG12_ULBT_Msk                (_U_(0x7) << MATRIX_MCFG12_ULBT_Pos)                 /**< (MATRIX_MCFG12) Undefined Length Burst Type Mask */
#define MATRIX_MCFG12_ULBT(value)             (MATRIX_MCFG12_ULBT_Msk & ((value) << MATRIX_MCFG12_ULBT_Pos))
#define   MATRIX_MCFG12_ULBT_UNLIMITED_Val    _U_(0x0)                                             /**< (MATRIX_MCFG12) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.  */
#define   MATRIX_MCFG12_ULBT_SINGLE_Val       _U_(0x1)                                             /**< (MATRIX_MCFG12) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.  */
#define   MATRIX_MCFG12_ULBT_4_BEAT_Val       _U_(0x2)                                             /**< (MATRIX_MCFG12) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.  */
#define   MATRIX_MCFG12_ULBT_8_BEAT_Val       _U_(0x3)                                             /**< (MATRIX_MCFG12) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.  */
#define   MATRIX_MCFG12_ULBT_16_BEAT_Val      _U_(0x4)                                             /**< (MATRIX_MCFG12) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.  */
#define   MATRIX_MCFG12_ULBT_32_BEAT_Val      _U_(0x5)                                             /**< (MATRIX_MCFG12) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.  */
#define   MATRIX_MCFG12_ULBT_64_BEAT_Val      _U_(0x6)                                             /**< (MATRIX_MCFG12) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.  */
#define   MATRIX_MCFG12_ULBT_128_BEAT_Val     _U_(0x7)                                             /**< (MATRIX_MCFG12) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving.  */
#define MATRIX_MCFG12_ULBT_UNLIMITED          (MATRIX_MCFG12_ULBT_UNLIMITED_Val << MATRIX_MCFG12_ULBT_Pos) /**< (MATRIX_MCFG12) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave. Position  */
#define MATRIX_MCFG12_ULBT_SINGLE             (MATRIX_MCFG12_ULBT_SINGLE_Val << MATRIX_MCFG12_ULBT_Pos) /**< (MATRIX_MCFG12) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence. Position  */
#define MATRIX_MCFG12_ULBT_4_BEAT             (MATRIX_MCFG12_ULBT_4_BEAT_Val << MATRIX_MCFG12_ULBT_Pos) /**< (MATRIX_MCFG12) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats. Position  */
#define MATRIX_MCFG12_ULBT_8_BEAT             (MATRIX_MCFG12_ULBT_8_BEAT_Val << MATRIX_MCFG12_ULBT_Pos) /**< (MATRIX_MCFG12) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats. Position  */
#define MATRIX_MCFG12_ULBT_16_BEAT            (MATRIX_MCFG12_ULBT_16_BEAT_Val << MATRIX_MCFG12_ULBT_Pos) /**< (MATRIX_MCFG12) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats. Position  */
#define MATRIX_MCFG12_ULBT_32_BEAT            (MATRIX_MCFG12_ULBT_32_BEAT_Val << MATRIX_MCFG12_ULBT_Pos) /**< (MATRIX_MCFG12) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats. Position  */
#define MATRIX_MCFG12_ULBT_64_BEAT            (MATRIX_MCFG12_ULBT_64_BEAT_Val << MATRIX_MCFG12_ULBT_Pos) /**< (MATRIX_MCFG12) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats. Position  */
#define MATRIX_MCFG12_ULBT_128_BEAT           (MATRIX_MCFG12_ULBT_128_BEAT_Val << MATRIX_MCFG12_ULBT_Pos) /**< (MATRIX_MCFG12) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving. Position  */
#define MATRIX_MCFG12_Msk                     _U_(0x00000007)                                      /**< (MATRIX_MCFG12) Register Mask  */


/* -------- MATRIX_MCFG13 : (MATRIX Offset: 0x34) (R/W 32) Master Configuration Register 13 -------- */
#define MATRIX_MCFG13_ULBT_Pos                _U_(0)                                               /**< (MATRIX_MCFG13) Undefined Length Burst Type Position */
#define MATRIX_MCFG13_ULBT_Msk                (_U_(0x7) << MATRIX_MCFG13_ULBT_Pos)                 /**< (MATRIX_MCFG13) Undefined Length Burst Type Mask */
#define MATRIX_MCFG13_ULBT(value)             (MATRIX_MCFG13_ULBT_Msk & ((value) << MATRIX_MCFG13_ULBT_Pos))
#define   MATRIX_MCFG13_ULBT_UNLIMITED_Val    _U_(0x0)                                             /**< (MATRIX_MCFG13) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.  */
#define   MATRIX_MCFG13_ULBT_SINGLE_Val       _U_(0x1)                                             /**< (MATRIX_MCFG13) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.  */
#define   MATRIX_MCFG13_ULBT_4_BEAT_Val       _U_(0x2)                                             /**< (MATRIX_MCFG13) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.  */
#define   MATRIX_MCFG13_ULBT_8_BEAT_Val       _U_(0x3)                                             /**< (MATRIX_MCFG13) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.  */
#define   MATRIX_MCFG13_ULBT_16_BEAT_Val      _U_(0x4)                                             /**< (MATRIX_MCFG13) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.  */
#define   MATRIX_MCFG13_ULBT_32_BEAT_Val      _U_(0x5)                                             /**< (MATRIX_MCFG13) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.  */
#define   MATRIX_MCFG13_ULBT_64_BEAT_Val      _U_(0x6)                                             /**< (MATRIX_MCFG13) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.  */
#define   MATRIX_MCFG13_ULBT_128_BEAT_Val     _U_(0x7)                                             /**< (MATRIX_MCFG13) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving.  */
#define MATRIX_MCFG13_ULBT_UNLIMITED          (MATRIX_MCFG13_ULBT_UNLIMITED_Val << MATRIX_MCFG13_ULBT_Pos) /**< (MATRIX_MCFG13) Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave. Position  */
#define MATRIX_MCFG13_ULBT_SINGLE             (MATRIX_MCFG13_ULBT_SINGLE_Val << MATRIX_MCFG13_ULBT_Pos) /**< (MATRIX_MCFG13) Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence. Position  */
#define MATRIX_MCFG13_ULBT_4_BEAT             (MATRIX_MCFG13_ULBT_4_BEAT_Val << MATRIX_MCFG13_ULBT_Pos) /**< (MATRIX_MCFG13) 4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats. Position  */
#define MATRIX_MCFG13_ULBT_8_BEAT             (MATRIX_MCFG13_ULBT_8_BEAT_Val << MATRIX_MCFG13_ULBT_Pos) /**< (MATRIX_MCFG13) 8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats. Position  */
#define MATRIX_MCFG13_ULBT_16_BEAT            (MATRIX_MCFG13_ULBT_16_BEAT_Val << MATRIX_MCFG13_ULBT_Pos) /**< (MATRIX_MCFG13) 16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats. Position  */
#define MATRIX_MCFG13_ULBT_32_BEAT            (MATRIX_MCFG13_ULBT_32_BEAT_Val << MATRIX_MCFG13_ULBT_Pos) /**< (MATRIX_MCFG13) 32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats. Position  */
#define MATRIX_MCFG13_ULBT_64_BEAT            (MATRIX_MCFG13_ULBT_64_BEAT_Val << MATRIX_MCFG13_ULBT_Pos) /**< (MATRIX_MCFG13) 64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats. Position  */
#define MATRIX_MCFG13_ULBT_128_BEAT           (MATRIX_MCFG13_ULBT_128_BEAT_Val << MATRIX_MCFG13_ULBT_Pos) /**< (MATRIX_MCFG13) 128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats.Unless duly needed, the ULBT should be left at its default 0 value for power saving. Position  */
#define MATRIX_MCFG13_Msk                     _U_(0x00000007)                                      /**< (MATRIX_MCFG13) Register Mask  */


