Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_SCFG6 : (MATRIX Offset: 0x58) (R/W 32) Slave Configuration Register 6 -------- */
#define MATRIX_SCFG6_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG6) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG6_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG6_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG6) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG6_SLOT_CYCLE(value)        (MATRIX_SCFG6_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG6_SLOT_CYCLE_Pos))
#define MATRIX_SCFG6_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG6) Default Master Type Position */
#define MATRIX_SCFG6_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG6_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG6) Default Master Type Mask */
#define MATRIX_SCFG6_DEFMSTR_TYPE(value)      (MATRIX_SCFG6_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG6_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG6_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG6) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG6_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG6) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG6_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG6) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG6_DEFMSTR_TYPE_NONE        (MATRIX_SCFG6_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG6_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG6) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG6_DEFMSTR_TYPE_LAST        (MATRIX_SCFG6_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG6_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG6) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG6_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG6_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG6_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG6) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG6_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG6) Fixed Default Master Position */
#define MATRIX_SCFG6_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG6_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG6) Fixed Default Master Mask */
#define MATRIX_SCFG6_FIXED_DEFMSTR(value)     (MATRIX_SCFG6_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG6_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG6_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG6) Register Mask  */


/* -------- MATRIX_SCFG7 : (MATRIX Offset: 0x5C) (R/W 32) Slave Configuration Register 7 -------- */
#define MATRIX_SCFG7_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG7) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG7_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG7_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG7) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG7_SLOT_CYCLE(value)        (MATRIX_SCFG7_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG7_SLOT_CYCLE_Pos))
#define MATRIX_SCFG7_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG7) Default Master Type Position */
#define MATRIX_SCFG7_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG7_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG7) Default Master Type Mask */
#define MATRIX_SCFG7_DEFMSTR_TYPE(value)      (MATRIX_SCFG7_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG7_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG7_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG7) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG7_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG7) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG7_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG7) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG7_DEFMSTR_TYPE_NONE        (MATRIX_SCFG7_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG7_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG7) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG7_DEFMSTR_TYPE_LAST        (MATRIX_SCFG7_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG7_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG7) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG7_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG7_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG7_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG7) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG7_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG7) Fixed Default Master Position */
#define MATRIX_SCFG7_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG7_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG7) Fixed Default Master Mask */
#define MATRIX_SCFG7_FIXED_DEFMSTR(value)     (MATRIX_SCFG7_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG7_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG7_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG7) Register Mask  */


/* -------- MATRIX_SCFG8 : (MATRIX Offset: 0x60) (R/W 32) Slave Configuration Register 8 -------- */
#define MATRIX_SCFG8_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG8) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG8_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG8_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG8) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG8_SLOT_CYCLE(value)        (MATRIX_SCFG8_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG8_SLOT_CYCLE_Pos))
#define MATRIX_SCFG8_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG8) Default Master Type Position */
#define MATRIX_SCFG8_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG8_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG8) Default Master Type Mask */
#define MATRIX_SCFG8_DEFMSTR_TYPE(value)      (MATRIX_SCFG8_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG8_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG8_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG8) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG8_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG8) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG8_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG8) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG8_DEFMSTR_TYPE_NONE        (MATRIX_SCFG8_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG8_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG8) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG8_DEFMSTR_TYPE_LAST        (MATRIX_SCFG8_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG8_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG8) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG8_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG8_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG8_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG8) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG8_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG8) Fixed Default Master Position */
#define MATRIX_SCFG8_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG8_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG8) Fixed Default Master Mask */
#define MATRIX_SCFG8_FIXED_DEFMSTR(value)     (MATRIX_SCFG8_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG8_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG8_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG8) Register Mask  */


/* -------- MATRIX_SCFG9 : (MATRIX Offset: 0x64) (R/W 32) Slave Configuration Register 9 -------- */
#define MATRIX_SCFG9_SLOT_CYCLE_Pos           _U_(0)                                               /**< (MATRIX_SCFG9) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG9_SLOT_CYCLE_Msk           (_U_(0x1FF) << MATRIX_SCFG9_SLOT_CYCLE_Pos)          /**< (MATRIX_SCFG9) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG9_SLOT_CYCLE(value)        (MATRIX_SCFG9_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG9_SLOT_CYCLE_Pos))
#define MATRIX_SCFG9_DEFMSTR_TYPE_Pos         _U_(16)                                              /**< (MATRIX_SCFG9) Default Master Type Position */
#define MATRIX_SCFG9_DEFMSTR_TYPE_Msk         (_U_(0x3) << MATRIX_SCFG9_DEFMSTR_TYPE_Pos)          /**< (MATRIX_SCFG9) Default Master Type Mask */
#define MATRIX_SCFG9_DEFMSTR_TYPE(value)      (MATRIX_SCFG9_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG9_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG9_DEFMSTR_TYPE_NONE_Val  _U_(0x0)                                             /**< (MATRIX_SCFG9) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG9_DEFMSTR_TYPE_LAST_Val  _U_(0x1)                                             /**< (MATRIX_SCFG9) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG9_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG9) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG9_DEFMSTR_TYPE_NONE        (MATRIX_SCFG9_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG9_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG9) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG9_DEFMSTR_TYPE_LAST        (MATRIX_SCFG9_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG9_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG9) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG9_DEFMSTR_TYPE_FIXED       (MATRIX_SCFG9_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG9_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG9) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG9_FIXED_DEFMSTR_Pos        _U_(18)                                              /**< (MATRIX_SCFG9) Fixed Default Master Position */
#define MATRIX_SCFG9_FIXED_DEFMSTR_Msk        (_U_(0xF) << MATRIX_SCFG9_FIXED_DEFMSTR_Pos)         /**< (MATRIX_SCFG9) Fixed Default Master Mask */
#define MATRIX_SCFG9_FIXED_DEFMSTR(value)     (MATRIX_SCFG9_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG9_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG9_Msk                      _U_(0x003F01FF)                                      /**< (MATRIX_SCFG9) Register Mask  */


/* -------- MATRIX_SCFG10 : (MATRIX Offset: 0x68) (R/W 32) Slave Configuration Register 10 -------- */
#define MATRIX_SCFG10_SLOT_CYCLE_Pos          _U_(0)                                               /**< (MATRIX_SCFG10) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG10_SLOT_CYCLE_Msk          (_U_(0x1FF) << MATRIX_SCFG10_SLOT_CYCLE_Pos)         /**< (MATRIX_SCFG10) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG10_SLOT_CYCLE(value)       (MATRIX_SCFG10_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG10_SLOT_CYCLE_Pos))
#define MATRIX_SCFG10_DEFMSTR_TYPE_Pos        _U_(16)                                              /**< (MATRIX_SCFG10) Default Master Type Position */
#define MATRIX_SCFG10_DEFMSTR_TYPE_Msk        (_U_(0x3) << MATRIX_SCFG10_DEFMSTR_TYPE_Pos)         /**< (MATRIX_SCFG10) Default Master Type Mask */
#define MATRIX_SCFG10_DEFMSTR_TYPE(value)     (MATRIX_SCFG10_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG10_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG10_DEFMSTR_TYPE_NONE_Val _U_(0x0)                                             /**< (MATRIX_SCFG10) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG10_DEFMSTR_TYPE_LAST_Val _U_(0x1)                                             /**< (MATRIX_SCFG10) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG10_DEFMSTR_TYPE_FIXED_Val _U_(0x2)                                             /**< (MATRIX_SCFG10) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG10_DEFMSTR_TYPE_NONE       (MATRIX_SCFG10_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG10_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG10) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG10_DEFMSTR_TYPE_LAST       (MATRIX_SCFG10_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG10_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG10) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG10_DEFMSTR_TYPE_FIXED      (MATRIX_SCFG10_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG10_DEFMSTR_TYPE_Pos) /**< (MATRIX_SCFG10) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG10_FIXED_DEFMSTR_Pos       _U_(18)                                              /**< (MATRIX_SCFG10) Fixed Default Master Position */
#define MATRIX_SCFG10_FIXED_DEFMSTR_Msk       (_U_(0xF) << MATRIX_SCFG10_FIXED_DEFMSTR_Pos)        /**< (MATRIX_SCFG10) Fixed Default Master Mask */
#define MATRIX_SCFG10_FIXED_DEFMSTR(value)    (MATRIX_SCFG10_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG10_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG10_Msk                     _U_(0x003F01FF)                                      /**< (MATRIX_SCFG10) Register Mask  */


