Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_PRBS11 : (MATRIX Offset: 0xDC) (R/W 32) Priority Register B for Slave 11 -------- */
#define MATRIX_PRBS11_M8PR_Pos                _U_(0)                                               /**< (MATRIX_PRBS11) Master 8 Priority Position */
#define MATRIX_PRBS11_M8PR_Msk                (_U_(0x3) << MATRIX_PRBS11_M8PR_Pos)                 /**< (MATRIX_PRBS11) Master 8 Priority Mask */
#define MATRIX_PRBS11_M8PR(value)             (MATRIX_PRBS11_M8PR_Msk & ((value) << MATRIX_PRBS11_M8PR_Pos))
#define MATRIX_PRBS11_LQOSEN8_Pos             _U_(2)                                               /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 8 Position */
#define MATRIX_PRBS11_LQOSEN8_Msk             (_U_(0x1) << MATRIX_PRBS11_LQOSEN8_Pos)              /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 8 Mask */
#define MATRIX_PRBS11_LQOSEN8(value)          (MATRIX_PRBS11_LQOSEN8_Msk & ((value) << MATRIX_PRBS11_LQOSEN8_Pos))
#define MATRIX_PRBS11_M9PR_Pos                _U_(4)                                               /**< (MATRIX_PRBS11) Master 9 Priority Position */
#define MATRIX_PRBS11_M9PR_Msk                (_U_(0x3) << MATRIX_PRBS11_M9PR_Pos)                 /**< (MATRIX_PRBS11) Master 9 Priority Mask */
#define MATRIX_PRBS11_M9PR(value)             (MATRIX_PRBS11_M9PR_Msk & ((value) << MATRIX_PRBS11_M9PR_Pos))
#define MATRIX_PRBS11_LQOSEN9_Pos             _U_(6)                                               /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 9 Position */
#define MATRIX_PRBS11_LQOSEN9_Msk             (_U_(0x1) << MATRIX_PRBS11_LQOSEN9_Pos)              /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 9 Mask */
#define MATRIX_PRBS11_LQOSEN9(value)          (MATRIX_PRBS11_LQOSEN9_Msk & ((value) << MATRIX_PRBS11_LQOSEN9_Pos))
#define MATRIX_PRBS11_M10PR_Pos               _U_(8)                                               /**< (MATRIX_PRBS11) Master 10 Priority Position */
#define MATRIX_PRBS11_M10PR_Msk               (_U_(0x3) << MATRIX_PRBS11_M10PR_Pos)                /**< (MATRIX_PRBS11) Master 10 Priority Mask */
#define MATRIX_PRBS11_M10PR(value)            (MATRIX_PRBS11_M10PR_Msk & ((value) << MATRIX_PRBS11_M10PR_Pos))
#define MATRIX_PRBS11_LQOSEN10_Pos            _U_(10)                                              /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 10 Position */
#define MATRIX_PRBS11_LQOSEN10_Msk            (_U_(0x1) << MATRIX_PRBS11_LQOSEN10_Pos)             /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 10 Mask */
#define MATRIX_PRBS11_LQOSEN10(value)         (MATRIX_PRBS11_LQOSEN10_Msk & ((value) << MATRIX_PRBS11_LQOSEN10_Pos))
#define MATRIX_PRBS11_M11PR_Pos               _U_(12)                                              /**< (MATRIX_PRBS11) Master 11 Priority Position */
#define MATRIX_PRBS11_M11PR_Msk               (_U_(0x3) << MATRIX_PRBS11_M11PR_Pos)                /**< (MATRIX_PRBS11) Master 11 Priority Mask */
#define MATRIX_PRBS11_M11PR(value)            (MATRIX_PRBS11_M11PR_Msk & ((value) << MATRIX_PRBS11_M11PR_Pos))
#define MATRIX_PRBS11_LQOSEN11_Pos            _U_(14)                                              /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 11 Position */
#define MATRIX_PRBS11_LQOSEN11_Msk            (_U_(0x1) << MATRIX_PRBS11_LQOSEN11_Pos)             /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 11 Mask */
#define MATRIX_PRBS11_LQOSEN11(value)         (MATRIX_PRBS11_LQOSEN11_Msk & ((value) << MATRIX_PRBS11_LQOSEN11_Pos))
#define MATRIX_PRBS11_M12PR_Pos               _U_(16)                                              /**< (MATRIX_PRBS11) Master 12 Priority Position */
#define MATRIX_PRBS11_M12PR_Msk               (_U_(0x3) << MATRIX_PRBS11_M12PR_Pos)                /**< (MATRIX_PRBS11) Master 12 Priority Mask */
#define MATRIX_PRBS11_M12PR(value)            (MATRIX_PRBS11_M12PR_Msk & ((value) << MATRIX_PRBS11_M12PR_Pos))
#define MATRIX_PRBS11_LQOSEN12_Pos            _U_(18)                                              /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 12 Position */
#define MATRIX_PRBS11_LQOSEN12_Msk            (_U_(0x1) << MATRIX_PRBS11_LQOSEN12_Pos)             /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 12 Mask */
#define MATRIX_PRBS11_LQOSEN12(value)         (MATRIX_PRBS11_LQOSEN12_Msk & ((value) << MATRIX_PRBS11_LQOSEN12_Pos))
#define MATRIX_PRBS11_M13PR_Pos               _U_(20)                                              /**< (MATRIX_PRBS11) Master 13 Priority Position */
#define MATRIX_PRBS11_M13PR_Msk               (_U_(0x3) << MATRIX_PRBS11_M13PR_Pos)                /**< (MATRIX_PRBS11) Master 13 Priority Mask */
#define MATRIX_PRBS11_M13PR(value)            (MATRIX_PRBS11_M13PR_Msk & ((value) << MATRIX_PRBS11_M13PR_Pos))
#define MATRIX_PRBS11_LQOSEN13_Pos            _U_(22)                                              /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 13 Position */
#define MATRIX_PRBS11_LQOSEN13_Msk            (_U_(0x1) << MATRIX_PRBS11_LQOSEN13_Pos)             /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 13 Mask */
#define MATRIX_PRBS11_LQOSEN13(value)         (MATRIX_PRBS11_LQOSEN13_Msk & ((value) << MATRIX_PRBS11_LQOSEN13_Pos))
#define MATRIX_PRBS11_M14PR_Pos               _U_(24)                                              /**< (MATRIX_PRBS11) Master 14 Priority Position */
#define MATRIX_PRBS11_M14PR_Msk               (_U_(0x3) << MATRIX_PRBS11_M14PR_Pos)                /**< (MATRIX_PRBS11) Master 14 Priority Mask */
#define MATRIX_PRBS11_M14PR(value)            (MATRIX_PRBS11_M14PR_Msk & ((value) << MATRIX_PRBS11_M14PR_Pos))
#define MATRIX_PRBS11_LQOSEN14_Pos            _U_(26)                                              /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 14 Position */
#define MATRIX_PRBS11_LQOSEN14_Msk            (_U_(0x1) << MATRIX_PRBS11_LQOSEN14_Pos)             /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 14 Mask */
#define MATRIX_PRBS11_LQOSEN14(value)         (MATRIX_PRBS11_LQOSEN14_Msk & ((value) << MATRIX_PRBS11_LQOSEN14_Pos))
#define MATRIX_PRBS11_M15PR_Pos               _U_(28)                                              /**< (MATRIX_PRBS11) Master 15 Priority Position */
#define MATRIX_PRBS11_M15PR_Msk               (_U_(0x3) << MATRIX_PRBS11_M15PR_Pos)                /**< (MATRIX_PRBS11) Master 15 Priority Mask */
#define MATRIX_PRBS11_M15PR(value)            (MATRIX_PRBS11_M15PR_Msk & ((value) << MATRIX_PRBS11_M15PR_Pos))
#define MATRIX_PRBS11_LQOSEN15_Pos            _U_(30)                                              /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 15 Position */
#define MATRIX_PRBS11_LQOSEN15_Msk            (_U_(0x1) << MATRIX_PRBS11_LQOSEN15_Pos)             /**< (MATRIX_PRBS11) Latency Quality of Service Enable for Master 15 Mask */
#define MATRIX_PRBS11_LQOSEN15(value)         (MATRIX_PRBS11_LQOSEN15_Msk & ((value) << MATRIX_PRBS11_LQOSEN15_Pos))
#define MATRIX_PRBS11_Msk                     _U_(0x77777777)                                      /**< (MATRIX_PRBS11) Register Mask  */


/* -------- MATRIX_PRAS12 : (MATRIX Offset: 0xE0) (R/W 32) Priority Register A for Slave 12 -------- */
#define MATRIX_PRAS12_M0PR_Pos                _U_(0)                                               /**< (MATRIX_PRAS12) Master 0 Priority Position */
#define MATRIX_PRAS12_M0PR_Msk                (_U_(0x3) << MATRIX_PRAS12_M0PR_Pos)                 /**< (MATRIX_PRAS12) Master 0 Priority Mask */
#define MATRIX_PRAS12_M0PR(value)             (MATRIX_PRAS12_M0PR_Msk & ((value) << MATRIX_PRAS12_M0PR_Pos))
#define MATRIX_PRAS12_LQOSEN0_Pos             _U_(2)                                               /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 0 Position */
#define MATRIX_PRAS12_LQOSEN0_Msk             (_U_(0x1) << MATRIX_PRAS12_LQOSEN0_Pos)              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 0 Mask */
#define MATRIX_PRAS12_LQOSEN0(value)          (MATRIX_PRAS12_LQOSEN0_Msk & ((value) << MATRIX_PRAS12_LQOSEN0_Pos))
#define MATRIX_PRAS12_M1PR_Pos                _U_(4)                                               /**< (MATRIX_PRAS12) Master 1 Priority Position */
#define MATRIX_PRAS12_M1PR_Msk                (_U_(0x3) << MATRIX_PRAS12_M1PR_Pos)                 /**< (MATRIX_PRAS12) Master 1 Priority Mask */
#define MATRIX_PRAS12_M1PR(value)             (MATRIX_PRAS12_M1PR_Msk & ((value) << MATRIX_PRAS12_M1PR_Pos))
#define MATRIX_PRAS12_LQOSEN1_Pos             _U_(6)                                               /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 1 Position */
#define MATRIX_PRAS12_LQOSEN1_Msk             (_U_(0x1) << MATRIX_PRAS12_LQOSEN1_Pos)              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 1 Mask */
#define MATRIX_PRAS12_LQOSEN1(value)          (MATRIX_PRAS12_LQOSEN1_Msk & ((value) << MATRIX_PRAS12_LQOSEN1_Pos))
#define MATRIX_PRAS12_M2PR_Pos                _U_(8)                                               /**< (MATRIX_PRAS12) Master 2 Priority Position */
#define MATRIX_PRAS12_M2PR_Msk                (_U_(0x3) << MATRIX_PRAS12_M2PR_Pos)                 /**< (MATRIX_PRAS12) Master 2 Priority Mask */
#define MATRIX_PRAS12_M2PR(value)             (MATRIX_PRAS12_M2PR_Msk & ((value) << MATRIX_PRAS12_M2PR_Pos))
#define MATRIX_PRAS12_LQOSEN2_Pos             _U_(10)                                              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 2 Position */
#define MATRIX_PRAS12_LQOSEN2_Msk             (_U_(0x1) << MATRIX_PRAS12_LQOSEN2_Pos)              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 2 Mask */
#define MATRIX_PRAS12_LQOSEN2(value)          (MATRIX_PRAS12_LQOSEN2_Msk & ((value) << MATRIX_PRAS12_LQOSEN2_Pos))
#define MATRIX_PRAS12_M3PR_Pos                _U_(12)                                              /**< (MATRIX_PRAS12) Master 3 Priority Position */
#define MATRIX_PRAS12_M3PR_Msk                (_U_(0x3) << MATRIX_PRAS12_M3PR_Pos)                 /**< (MATRIX_PRAS12) Master 3 Priority Mask */
#define MATRIX_PRAS12_M3PR(value)             (MATRIX_PRAS12_M3PR_Msk & ((value) << MATRIX_PRAS12_M3PR_Pos))
#define MATRIX_PRAS12_LQOSEN3_Pos             _U_(14)                                              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 3 Position */
#define MATRIX_PRAS12_LQOSEN3_Msk             (_U_(0x1) << MATRIX_PRAS12_LQOSEN3_Pos)              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 3 Mask */
#define MATRIX_PRAS12_LQOSEN3(value)          (MATRIX_PRAS12_LQOSEN3_Msk & ((value) << MATRIX_PRAS12_LQOSEN3_Pos))
#define MATRIX_PRAS12_M4PR_Pos                _U_(16)                                              /**< (MATRIX_PRAS12) Master 4 Priority Position */
#define MATRIX_PRAS12_M4PR_Msk                (_U_(0x3) << MATRIX_PRAS12_M4PR_Pos)                 /**< (MATRIX_PRAS12) Master 4 Priority Mask */
#define MATRIX_PRAS12_M4PR(value)             (MATRIX_PRAS12_M4PR_Msk & ((value) << MATRIX_PRAS12_M4PR_Pos))
#define MATRIX_PRAS12_LQOSEN4_Pos             _U_(18)                                              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 4 Position */
#define MATRIX_PRAS12_LQOSEN4_Msk             (_U_(0x1) << MATRIX_PRAS12_LQOSEN4_Pos)              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 4 Mask */
#define MATRIX_PRAS12_LQOSEN4(value)          (MATRIX_PRAS12_LQOSEN4_Msk & ((value) << MATRIX_PRAS12_LQOSEN4_Pos))
#define MATRIX_PRAS12_M5PR_Pos                _U_(20)                                              /**< (MATRIX_PRAS12) Master 5 Priority Position */
#define MATRIX_PRAS12_M5PR_Msk                (_U_(0x3) << MATRIX_PRAS12_M5PR_Pos)                 /**< (MATRIX_PRAS12) Master 5 Priority Mask */
#define MATRIX_PRAS12_M5PR(value)             (MATRIX_PRAS12_M5PR_Msk & ((value) << MATRIX_PRAS12_M5PR_Pos))
#define MATRIX_PRAS12_LQOSEN5_Pos             _U_(22)                                              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 5 Position */
#define MATRIX_PRAS12_LQOSEN5_Msk             (_U_(0x1) << MATRIX_PRAS12_LQOSEN5_Pos)              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 5 Mask */
#define MATRIX_PRAS12_LQOSEN5(value)          (MATRIX_PRAS12_LQOSEN5_Msk & ((value) << MATRIX_PRAS12_LQOSEN5_Pos))
#define MATRIX_PRAS12_M6PR_Pos                _U_(24)                                              /**< (MATRIX_PRAS12) Master 6 Priority Position */
#define MATRIX_PRAS12_M6PR_Msk                (_U_(0x3) << MATRIX_PRAS12_M6PR_Pos)                 /**< (MATRIX_PRAS12) Master 6 Priority Mask */
#define MATRIX_PRAS12_M6PR(value)             (MATRIX_PRAS12_M6PR_Msk & ((value) << MATRIX_PRAS12_M6PR_Pos))
#define MATRIX_PRAS12_LQOSEN6_Pos             _U_(26)                                              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 6 Position */
#define MATRIX_PRAS12_LQOSEN6_Msk             (_U_(0x1) << MATRIX_PRAS12_LQOSEN6_Pos)              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 6 Mask */
#define MATRIX_PRAS12_LQOSEN6(value)          (MATRIX_PRAS12_LQOSEN6_Msk & ((value) << MATRIX_PRAS12_LQOSEN6_Pos))
#define MATRIX_PRAS12_M7PR_Pos                _U_(28)                                              /**< (MATRIX_PRAS12) Master 7 Priority Position */
#define MATRIX_PRAS12_M7PR_Msk                (_U_(0x3) << MATRIX_PRAS12_M7PR_Pos)                 /**< (MATRIX_PRAS12) Master 7 Priority Mask */
#define MATRIX_PRAS12_M7PR(value)             (MATRIX_PRAS12_M7PR_Msk & ((value) << MATRIX_PRAS12_M7PR_Pos))
#define MATRIX_PRAS12_LQOSEN7_Pos             _U_(30)                                              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 7 Position */
#define MATRIX_PRAS12_LQOSEN7_Msk             (_U_(0x1) << MATRIX_PRAS12_LQOSEN7_Pos)              /**< (MATRIX_PRAS12) Latency Quality of Service Enable for Master 7 Mask */
#define MATRIX_PRAS12_LQOSEN7(value)          (MATRIX_PRAS12_LQOSEN7_Msk & ((value) << MATRIX_PRAS12_LQOSEN7_Pos))
#define MATRIX_PRAS12_Msk                     _U_(0x77777777)                                      /**< (MATRIX_PRAS12) Register Mask  */


