Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_MEAR15 : (MATRIX Offset: 0x19C) ( R/ 32) Master 0 Error Address Register 15 -------- */
#define MATRIX_MEAR15_ERRADD_Pos              _U_(0)                                               /**< (MATRIX_MEAR15) Master Error Address Position */
#define MATRIX_MEAR15_ERRADD_Msk              (_U_(0xFFFFFFFF) << MATRIX_MEAR15_ERRADD_Pos)        /**< (MATRIX_MEAR15) Master Error Address Mask */
#define MATRIX_MEAR15_ERRADD(value)           (MATRIX_MEAR15_ERRADD_Msk & ((value) << MATRIX_MEAR15_ERRADD_Pos))
#define MATRIX_MEAR15_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR15) Register Mask  */


/* -------- MATRIX_WPMR : (MATRIX Offset: 0x1E4) (R/W 32) Write Protect Mode Register -------- */
#define MATRIX_WPMR_WPEN_Pos                  _U_(0)                                               /**< (MATRIX_WPMR) Write Protection Enable Position */
#define MATRIX_WPMR_WPEN_Msk                  (_U_(0x1) << MATRIX_WPMR_WPEN_Pos)                   /**< (MATRIX_WPMR) Write Protection Enable Mask */
#define MATRIX_WPMR_WPEN(value)               (MATRIX_WPMR_WPEN_Msk & ((value) << MATRIX_WPMR_WPEN_Pos))
#define MATRIX_WPMR_CFGFRZ_Pos                _U_(7)                                               /**< (MATRIX_WPMR)  Position */
#define MATRIX_WPMR_CFGFRZ_Msk                (_U_(0x1) << MATRIX_WPMR_CFGFRZ_Pos)                 /**< (MATRIX_WPMR)  Mask */
#define MATRIX_WPMR_CFGFRZ(value)             (MATRIX_WPMR_CFGFRZ_Msk & ((value) << MATRIX_WPMR_CFGFRZ_Pos))
#define MATRIX_WPMR_WPKEY_Pos                 _U_(8)                                               /**< (MATRIX_WPMR) Write Protection Key Position */
#define MATRIX_WPMR_WPKEY_Msk                 (_U_(0xFFFFFF) << MATRIX_WPMR_WPKEY_Pos)             /**< (MATRIX_WPMR) Write Protection Key Mask */
#define MATRIX_WPMR_WPKEY(value)              (MATRIX_WPMR_WPKEY_Msk & ((value) << MATRIX_WPMR_WPKEY_Pos))
#define   MATRIX_WPMR_WPKEY_PASSWD_Val        _U_(0x4D4154)                                        /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN and CFGFRZ bits. Always reads as 0.  */
#define MATRIX_WPMR_WPKEY_PASSWD              (MATRIX_WPMR_WPKEY_PASSWD_Val << MATRIX_WPMR_WPKEY_Pos) /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN and CFGFRZ bits. Always reads as 0. Position  */
#define MATRIX_WPMR_Msk                       _U_(0xFFFFFF81)                                      /**< (MATRIX_WPMR) Register Mask  */


/* -------- MATRIX_WPSR : (MATRIX Offset: 0x1E8) ( R/ 32) Write Protect Status Register -------- */
#define MATRIX_WPSR_WPVS_Pos                  _U_(0)                                               /**< (MATRIX_WPSR) Write Protection Violation Status Position */
#define MATRIX_WPSR_WPVS_Msk                  (_U_(0x1) << MATRIX_WPSR_WPVS_Pos)                   /**< (MATRIX_WPSR) Write Protection Violation Status Mask */
#define MATRIX_WPSR_WPVS(value)               (MATRIX_WPSR_WPVS_Msk & ((value) << MATRIX_WPSR_WPVS_Pos))
#define MATRIX_WPSR_WPVSRC_Pos                _U_(8)                                               /**< (MATRIX_WPSR) Write Protection Violation Source Position */
#define MATRIX_WPSR_WPVSRC_Msk                (_U_(0xFFFF) << MATRIX_WPSR_WPVSRC_Pos)              /**< (MATRIX_WPSR) Write Protection Violation Source Mask */
#define MATRIX_WPSR_WPVSRC(value)             (MATRIX_WPSR_WPVSRC_Msk & ((value) << MATRIX_WPSR_WPVSRC_Pos))
#define MATRIX_WPSR_Msk                       _U_(0x00FFFF01)                                      /**< (MATRIX_WPSR) Register Mask  */


/* -------- MATRIX_PSR0 : (MATRIX Offset: 0x200) (R/W 32) Protection Slave 0 Register 0 -------- */
#define MATRIX_PSR0_LAUSERH0_Pos              _U_(0)                                               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR0_LAUSERH0_Msk              (_U_(0x1) << MATRIX_PSR0_LAUSERH0_Pos)               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR0_LAUSERH0(value)           (MATRIX_PSR0_LAUSERH0_Msk & ((value) << MATRIX_PSR0_LAUSERH0_Pos))
#define MATRIX_PSR0_LAUSERH1_Pos              _U_(1)                                               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR0_LAUSERH1_Msk              (_U_(0x1) << MATRIX_PSR0_LAUSERH1_Pos)               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR0_LAUSERH1(value)           (MATRIX_PSR0_LAUSERH1_Msk & ((value) << MATRIX_PSR0_LAUSERH1_Pos))
#define MATRIX_PSR0_LAUSERH2_Pos              _U_(2)                                               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR0_LAUSERH2_Msk              (_U_(0x1) << MATRIX_PSR0_LAUSERH2_Pos)               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR0_LAUSERH2(value)           (MATRIX_PSR0_LAUSERH2_Msk & ((value) << MATRIX_PSR0_LAUSERH2_Pos))
#define MATRIX_PSR0_LAUSERH3_Pos              _U_(3)                                               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR0_LAUSERH3_Msk              (_U_(0x1) << MATRIX_PSR0_LAUSERH3_Pos)               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR0_LAUSERH3(value)           (MATRIX_PSR0_LAUSERH3_Msk & ((value) << MATRIX_PSR0_LAUSERH3_Pos))
#define MATRIX_PSR0_LAUSERH4_Pos              _U_(4)                                               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR0_LAUSERH4_Msk              (_U_(0x1) << MATRIX_PSR0_LAUSERH4_Pos)               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR0_LAUSERH4(value)           (MATRIX_PSR0_LAUSERH4_Msk & ((value) << MATRIX_PSR0_LAUSERH4_Pos))
#define MATRIX_PSR0_LAUSERH5_Pos              _U_(5)                                               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR0_LAUSERH5_Msk              (_U_(0x1) << MATRIX_PSR0_LAUSERH5_Pos)               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR0_LAUSERH5(value)           (MATRIX_PSR0_LAUSERH5_Msk & ((value) << MATRIX_PSR0_LAUSERH5_Pos))
#define MATRIX_PSR0_LAUSERH6_Pos              _U_(6)                                               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR0_LAUSERH6_Msk              (_U_(0x1) << MATRIX_PSR0_LAUSERH6_Pos)               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR0_LAUSERH6(value)           (MATRIX_PSR0_LAUSERH6_Msk & ((value) << MATRIX_PSR0_LAUSERH6_Pos))
#define MATRIX_PSR0_LAUSERH7_Pos              _U_(7)                                               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR0_LAUSERH7_Msk              (_U_(0x1) << MATRIX_PSR0_LAUSERH7_Pos)               /**< (MATRIX_PSR0) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR0_LAUSERH7(value)           (MATRIX_PSR0_LAUSERH7_Msk & ((value) << MATRIX_PSR0_LAUSERH7_Pos))
#define MATRIX_PSR0_RDUSERH0_Pos              _U_(8)                                               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR0_RDUSERH0_Msk              (_U_(0x1) << MATRIX_PSR0_RDUSERH0_Pos)               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_RDUSERH0(value)           (MATRIX_PSR0_RDUSERH0_Msk & ((value) << MATRIX_PSR0_RDUSERH0_Pos))
#define MATRIX_PSR0_RDUSERH1_Pos              _U_(9)                                               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR0_RDUSERH1_Msk              (_U_(0x1) << MATRIX_PSR0_RDUSERH1_Pos)               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_RDUSERH1(value)           (MATRIX_PSR0_RDUSERH1_Msk & ((value) << MATRIX_PSR0_RDUSERH1_Pos))
#define MATRIX_PSR0_RDUSERH2_Pos              _U_(10)                                              /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR0_RDUSERH2_Msk              (_U_(0x1) << MATRIX_PSR0_RDUSERH2_Pos)               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_RDUSERH2(value)           (MATRIX_PSR0_RDUSERH2_Msk & ((value) << MATRIX_PSR0_RDUSERH2_Pos))
#define MATRIX_PSR0_RDUSERH3_Pos              _U_(11)                                              /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR0_RDUSERH3_Msk              (_U_(0x1) << MATRIX_PSR0_RDUSERH3_Pos)               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_RDUSERH3(value)           (MATRIX_PSR0_RDUSERH3_Msk & ((value) << MATRIX_PSR0_RDUSERH3_Pos))
#define MATRIX_PSR0_RDUSERH4_Pos              _U_(12)                                              /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR0_RDUSERH4_Msk              (_U_(0x1) << MATRIX_PSR0_RDUSERH4_Pos)               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_RDUSERH4(value)           (MATRIX_PSR0_RDUSERH4_Msk & ((value) << MATRIX_PSR0_RDUSERH4_Pos))
#define MATRIX_PSR0_RDUSERH5_Pos              _U_(13)                                              /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR0_RDUSERH5_Msk              (_U_(0x1) << MATRIX_PSR0_RDUSERH5_Pos)               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_RDUSERH5(value)           (MATRIX_PSR0_RDUSERH5_Msk & ((value) << MATRIX_PSR0_RDUSERH5_Pos))
#define MATRIX_PSR0_RDUSERH6_Pos              _U_(14)                                              /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR0_RDUSERH6_Msk              (_U_(0x1) << MATRIX_PSR0_RDUSERH6_Pos)               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_RDUSERH6(value)           (MATRIX_PSR0_RDUSERH6_Msk & ((value) << MATRIX_PSR0_RDUSERH6_Pos))
#define MATRIX_PSR0_RDUSERH7_Pos              _U_(15)                                              /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR0_RDUSERH7_Msk              (_U_(0x1) << MATRIX_PSR0_RDUSERH7_Pos)               /**< (MATRIX_PSR0) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_RDUSERH7(value)           (MATRIX_PSR0_RDUSERH7_Msk & ((value) << MATRIX_PSR0_RDUSERH7_Pos))
#define MATRIX_PSR0_WRUSERH0_Pos              _U_(16)                                              /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR0_WRUSERH0_Msk              (_U_(0x1) << MATRIX_PSR0_WRUSERH0_Pos)               /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_WRUSERH0(value)           (MATRIX_PSR0_WRUSERH0_Msk & ((value) << MATRIX_PSR0_WRUSERH0_Pos))
#define MATRIX_PSR0_WRUSERH1_Pos              _U_(17)                                              /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR0_WRUSERH1_Msk              (_U_(0x1) << MATRIX_PSR0_WRUSERH1_Pos)               /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_WRUSERH1(value)           (MATRIX_PSR0_WRUSERH1_Msk & ((value) << MATRIX_PSR0_WRUSERH1_Pos))
#define MATRIX_PSR0_WRUSERH2_Pos              _U_(18)                                              /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR0_WRUSERH2_Msk              (_U_(0x1) << MATRIX_PSR0_WRUSERH2_Pos)               /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_WRUSERH2(value)           (MATRIX_PSR0_WRUSERH2_Msk & ((value) << MATRIX_PSR0_WRUSERH2_Pos))
#define MATRIX_PSR0_WRUSERH3_Pos              _U_(19)                                              /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR0_WRUSERH3_Msk              (_U_(0x1) << MATRIX_PSR0_WRUSERH3_Pos)               /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_WRUSERH3(value)           (MATRIX_PSR0_WRUSERH3_Msk & ((value) << MATRIX_PSR0_WRUSERH3_Pos))
#define MATRIX_PSR0_WRUSERH4_Pos              _U_(20)                                              /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR0_WRUSERH4_Msk              (_U_(0x1) << MATRIX_PSR0_WRUSERH4_Pos)               /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_WRUSERH4(value)           (MATRIX_PSR0_WRUSERH4_Msk & ((value) << MATRIX_PSR0_WRUSERH4_Pos))
#define MATRIX_PSR0_WRUSERH5_Pos              _U_(21)                                              /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR0_WRUSERH5_Msk              (_U_(0x1) << MATRIX_PSR0_WRUSERH5_Pos)               /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_WRUSERH5(value)           (MATRIX_PSR0_WRUSERH5_Msk & ((value) << MATRIX_PSR0_WRUSERH5_Pos))
#define MATRIX_PSR0_WRUSERH6_Pos              _U_(22)                                              /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR0_WRUSERH6_Msk              (_U_(0x1) << MATRIX_PSR0_WRUSERH6_Pos)               /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_WRUSERH6(value)           (MATRIX_PSR0_WRUSERH6_Msk & ((value) << MATRIX_PSR0_WRUSERH6_Pos))
#define MATRIX_PSR0_WRUSERH7_Pos              _U_(23)                                              /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR0_WRUSERH7_Msk              (_U_(0x1) << MATRIX_PSR0_WRUSERH7_Pos)               /**< (MATRIX_PSR0) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR0_WRUSERH7(value)           (MATRIX_PSR0_WRUSERH7_Msk & ((value) << MATRIX_PSR0_WRUSERH7_Pos))
#define MATRIX_PSR0_DPSOA0_Pos                _U_(24)                                              /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR0_DPSOA0_Msk                (_U_(0x1) << MATRIX_PSR0_DPSOA0_Pos)                 /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR0_DPSOA0(value)             (MATRIX_PSR0_DPSOA0_Msk & ((value) << MATRIX_PSR0_DPSOA0_Pos))
#define MATRIX_PSR0_DPSOA1_Pos                _U_(25)                                              /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR0_DPSOA1_Msk                (_U_(0x1) << MATRIX_PSR0_DPSOA1_Pos)                 /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR0_DPSOA1(value)             (MATRIX_PSR0_DPSOA1_Msk & ((value) << MATRIX_PSR0_DPSOA1_Pos))
#define MATRIX_PSR0_DPSOA2_Pos                _U_(26)                                              /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR0_DPSOA2_Msk                (_U_(0x1) << MATRIX_PSR0_DPSOA2_Pos)                 /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR0_DPSOA2(value)             (MATRIX_PSR0_DPSOA2_Msk & ((value) << MATRIX_PSR0_DPSOA2_Pos))
#define MATRIX_PSR0_DPSOA3_Pos                _U_(27)                                              /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR0_DPSOA3_Msk                (_U_(0x1) << MATRIX_PSR0_DPSOA3_Pos)                 /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR0_DPSOA3(value)             (MATRIX_PSR0_DPSOA3_Msk & ((value) << MATRIX_PSR0_DPSOA3_Pos))
#define MATRIX_PSR0_DPSOA4_Pos                _U_(28)                                              /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR0_DPSOA4_Msk                (_U_(0x1) << MATRIX_PSR0_DPSOA4_Pos)                 /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR0_DPSOA4(value)             (MATRIX_PSR0_DPSOA4_Msk & ((value) << MATRIX_PSR0_DPSOA4_Pos))
#define MATRIX_PSR0_DPSOA5_Pos                _U_(29)                                              /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR0_DPSOA5_Msk                (_U_(0x1) << MATRIX_PSR0_DPSOA5_Pos)                 /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR0_DPSOA5(value)             (MATRIX_PSR0_DPSOA5_Msk & ((value) << MATRIX_PSR0_DPSOA5_Pos))
#define MATRIX_PSR0_DPSOA6_Pos                _U_(30)                                              /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR0_DPSOA6_Msk                (_U_(0x1) << MATRIX_PSR0_DPSOA6_Pos)                 /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR0_DPSOA6(value)             (MATRIX_PSR0_DPSOA6_Msk & ((value) << MATRIX_PSR0_DPSOA6_Pos))
#define MATRIX_PSR0_DPSOA7_Pos                _U_(31)                                              /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR0_DPSOA7_Msk                (_U_(0x1) << MATRIX_PSR0_DPSOA7_Pos)                 /**< (MATRIX_PSR0) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR0_DPSOA7(value)             (MATRIX_PSR0_DPSOA7_Msk & ((value) << MATRIX_PSR0_DPSOA7_Pos))
#define MATRIX_PSR0_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_PSR0) Register Mask  */

#define MATRIX_PSR0_LAUSERH_Pos               _U_(0)                                               /**< (MATRIX_PSR0 Position) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR0_LAUSERH_Msk               (_U_(0xFF) << MATRIX_PSR0_LAUSERH_Pos)               /**< (MATRIX_PSR0 Mask) LAUSERH */
#define MATRIX_PSR0_LAUSERH(value)            (MATRIX_PSR0_LAUSERH_Msk & ((value) << MATRIX_PSR0_LAUSERH_Pos)) 
#define MATRIX_PSR0_RDUSERH_Pos               _U_(8)                                               /**< (MATRIX_PSR0 Position) Read USER for HSELx Protected Region */
#define MATRIX_PSR0_RDUSERH_Msk               (_U_(0xFF) << MATRIX_PSR0_RDUSERH_Pos)               /**< (MATRIX_PSR0 Mask) RDUSERH */
#define MATRIX_PSR0_RDUSERH(value)            (MATRIX_PSR0_RDUSERH_Msk & ((value) << MATRIX_PSR0_RDUSERH_Pos)) 
#define MATRIX_PSR0_WRUSERH_Pos               _U_(16)                                              /**< (MATRIX_PSR0 Position) Write USER for HSELx Protected Region */
#define MATRIX_PSR0_WRUSERH_Msk               (_U_(0xFF) << MATRIX_PSR0_WRUSERH_Pos)               /**< (MATRIX_PSR0 Mask) WRUSERH */
#define MATRIX_PSR0_WRUSERH(value)            (MATRIX_PSR0_WRUSERH_Msk & ((value) << MATRIX_PSR0_WRUSERH_Pos)) 
#define MATRIX_PSR0_DPSOA_Pos                 _U_(24)                                              /**< (MATRIX_PSR0 Position) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR0_DPSOA_Msk                 (_U_(0xFF) << MATRIX_PSR0_DPSOA_Pos)                 /**< (MATRIX_PSR0 Mask) DPSOA */
#define MATRIX_PSR0_DPSOA(value)              (MATRIX_PSR0_DPSOA_Msk & ((value) << MATRIX_PSR0_DPSOA_Pos)) 

