Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
#define MATRIX_PSR14_LAUSERH_Pos              _U_(0)                                               /**< (MATRIX_PSR14 Position) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR14_LAUSERH_Msk              (_U_(0xFF) << MATRIX_PSR14_LAUSERH_Pos)              /**< (MATRIX_PSR14 Mask) LAUSERH */
#define MATRIX_PSR14_LAUSERH(value)           (MATRIX_PSR14_LAUSERH_Msk & ((value) << MATRIX_PSR14_LAUSERH_Pos)) 
#define MATRIX_PSR14_RDUSERH_Pos              _U_(8)                                               /**< (MATRIX_PSR14 Position) Read USER for HSELx Protected Region */
#define MATRIX_PSR14_RDUSERH_Msk              (_U_(0xFF) << MATRIX_PSR14_RDUSERH_Pos)              /**< (MATRIX_PSR14 Mask) RDUSERH */
#define MATRIX_PSR14_RDUSERH(value)           (MATRIX_PSR14_RDUSERH_Msk & ((value) << MATRIX_PSR14_RDUSERH_Pos)) 
#define MATRIX_PSR14_WRUSERH_Pos              _U_(16)                                              /**< (MATRIX_PSR14 Position) Write USER for HSELx Protected Region */
#define MATRIX_PSR14_WRUSERH_Msk              (_U_(0xFF) << MATRIX_PSR14_WRUSERH_Pos)              /**< (MATRIX_PSR14 Mask) WRUSERH */
#define MATRIX_PSR14_WRUSERH(value)           (MATRIX_PSR14_WRUSERH_Msk & ((value) << MATRIX_PSR14_WRUSERH_Pos)) 
#define MATRIX_PSR14_DPSOA_Pos                _U_(24)                                              /**< (MATRIX_PSR14 Position) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR14_DPSOA_Msk                (_U_(0xFF) << MATRIX_PSR14_DPSOA_Pos)                /**< (MATRIX_PSR14 Mask) DPSOA */
#define MATRIX_PSR14_DPSOA(value)             (MATRIX_PSR14_DPSOA_Msk & ((value) << MATRIX_PSR14_DPSOA_Pos)) 

/* -------- MATRIX_PSR15 : (MATRIX Offset: 0x23C) (R/W 32) Protection Slave 0 Register 15 -------- */
#define MATRIX_PSR15_LAUSERH0_Pos             _U_(0)                                               /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR15_LAUSERH0_Msk             (_U_(0x1) << MATRIX_PSR15_LAUSERH0_Pos)              /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR15_LAUSERH0(value)          (MATRIX_PSR15_LAUSERH0_Msk & ((value) << MATRIX_PSR15_LAUSERH0_Pos))
#define MATRIX_PSR15_LAUSERH1_Pos             _U_(1)                                               /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR15_LAUSERH1_Msk             (_U_(0x1) << MATRIX_PSR15_LAUSERH1_Pos)              /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR15_LAUSERH1(value)          (MATRIX_PSR15_LAUSERH1_Msk & ((value) << MATRIX_PSR15_LAUSERH1_Pos))
#define MATRIX_PSR15_LAUSERH2_Pos             _U_(2)                                               /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR15_LAUSERH2_Msk             (_U_(0x1) << MATRIX_PSR15_LAUSERH2_Pos)              /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR15_LAUSERH2(value)          (MATRIX_PSR15_LAUSERH2_Msk & ((value) << MATRIX_PSR15_LAUSERH2_Pos))
#define MATRIX_PSR15_LAUSERH3_Pos             _U_(3)                                               /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR15_LAUSERH3_Msk             (_U_(0x1) << MATRIX_PSR15_LAUSERH3_Pos)              /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR15_LAUSERH3(value)          (MATRIX_PSR15_LAUSERH3_Msk & ((value) << MATRIX_PSR15_LAUSERH3_Pos))
#define MATRIX_PSR15_LAUSERH4_Pos             _U_(4)                                               /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR15_LAUSERH4_Msk             (_U_(0x1) << MATRIX_PSR15_LAUSERH4_Pos)              /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR15_LAUSERH4(value)          (MATRIX_PSR15_LAUSERH4_Msk & ((value) << MATRIX_PSR15_LAUSERH4_Pos))
#define MATRIX_PSR15_LAUSERH5_Pos             _U_(5)                                               /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR15_LAUSERH5_Msk             (_U_(0x1) << MATRIX_PSR15_LAUSERH5_Pos)              /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR15_LAUSERH5(value)          (MATRIX_PSR15_LAUSERH5_Msk & ((value) << MATRIX_PSR15_LAUSERH5_Pos))
#define MATRIX_PSR15_LAUSERH6_Pos             _U_(6)                                               /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR15_LAUSERH6_Msk             (_U_(0x1) << MATRIX_PSR15_LAUSERH6_Pos)              /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR15_LAUSERH6(value)          (MATRIX_PSR15_LAUSERH6_Msk & ((value) << MATRIX_PSR15_LAUSERH6_Pos))
#define MATRIX_PSR15_LAUSERH7_Pos             _U_(7)                                               /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Position */
#define MATRIX_PSR15_LAUSERH7_Msk             (_U_(0x1) << MATRIX_PSR15_LAUSERH7_Pos)              /**< (MATRIX_PSR15) Low Area USER in HSELx Protected Region Mask */
#define MATRIX_PSR15_LAUSERH7(value)          (MATRIX_PSR15_LAUSERH7_Msk & ((value) << MATRIX_PSR15_LAUSERH7_Pos))
#define MATRIX_PSR15_RDUSERH0_Pos             _U_(8)                                               /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR15_RDUSERH0_Msk             (_U_(0x1) << MATRIX_PSR15_RDUSERH0_Pos)              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_RDUSERH0(value)          (MATRIX_PSR15_RDUSERH0_Msk & ((value) << MATRIX_PSR15_RDUSERH0_Pos))
#define MATRIX_PSR15_RDUSERH1_Pos             _U_(9)                                               /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR15_RDUSERH1_Msk             (_U_(0x1) << MATRIX_PSR15_RDUSERH1_Pos)              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_RDUSERH1(value)          (MATRIX_PSR15_RDUSERH1_Msk & ((value) << MATRIX_PSR15_RDUSERH1_Pos))
#define MATRIX_PSR15_RDUSERH2_Pos             _U_(10)                                              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR15_RDUSERH2_Msk             (_U_(0x1) << MATRIX_PSR15_RDUSERH2_Pos)              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_RDUSERH2(value)          (MATRIX_PSR15_RDUSERH2_Msk & ((value) << MATRIX_PSR15_RDUSERH2_Pos))
#define MATRIX_PSR15_RDUSERH3_Pos             _U_(11)                                              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR15_RDUSERH3_Msk             (_U_(0x1) << MATRIX_PSR15_RDUSERH3_Pos)              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_RDUSERH3(value)          (MATRIX_PSR15_RDUSERH3_Msk & ((value) << MATRIX_PSR15_RDUSERH3_Pos))
#define MATRIX_PSR15_RDUSERH4_Pos             _U_(12)                                              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR15_RDUSERH4_Msk             (_U_(0x1) << MATRIX_PSR15_RDUSERH4_Pos)              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_RDUSERH4(value)          (MATRIX_PSR15_RDUSERH4_Msk & ((value) << MATRIX_PSR15_RDUSERH4_Pos))
#define MATRIX_PSR15_RDUSERH5_Pos             _U_(13)                                              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR15_RDUSERH5_Msk             (_U_(0x1) << MATRIX_PSR15_RDUSERH5_Pos)              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_RDUSERH5(value)          (MATRIX_PSR15_RDUSERH5_Msk & ((value) << MATRIX_PSR15_RDUSERH5_Pos))
#define MATRIX_PSR15_RDUSERH6_Pos             _U_(14)                                              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR15_RDUSERH6_Msk             (_U_(0x1) << MATRIX_PSR15_RDUSERH6_Pos)              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_RDUSERH6(value)          (MATRIX_PSR15_RDUSERH6_Msk & ((value) << MATRIX_PSR15_RDUSERH6_Pos))
#define MATRIX_PSR15_RDUSERH7_Pos             _U_(15)                                              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Position */
#define MATRIX_PSR15_RDUSERH7_Msk             (_U_(0x1) << MATRIX_PSR15_RDUSERH7_Pos)              /**< (MATRIX_PSR15) Read USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_RDUSERH7(value)          (MATRIX_PSR15_RDUSERH7_Msk & ((value) << MATRIX_PSR15_RDUSERH7_Pos))
#define MATRIX_PSR15_WRUSERH0_Pos             _U_(16)                                              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR15_WRUSERH0_Msk             (_U_(0x1) << MATRIX_PSR15_WRUSERH0_Pos)              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_WRUSERH0(value)          (MATRIX_PSR15_WRUSERH0_Msk & ((value) << MATRIX_PSR15_WRUSERH0_Pos))
#define MATRIX_PSR15_WRUSERH1_Pos             _U_(17)                                              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR15_WRUSERH1_Msk             (_U_(0x1) << MATRIX_PSR15_WRUSERH1_Pos)              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_WRUSERH1(value)          (MATRIX_PSR15_WRUSERH1_Msk & ((value) << MATRIX_PSR15_WRUSERH1_Pos))
#define MATRIX_PSR15_WRUSERH2_Pos             _U_(18)                                              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR15_WRUSERH2_Msk             (_U_(0x1) << MATRIX_PSR15_WRUSERH2_Pos)              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_WRUSERH2(value)          (MATRIX_PSR15_WRUSERH2_Msk & ((value) << MATRIX_PSR15_WRUSERH2_Pos))
#define MATRIX_PSR15_WRUSERH3_Pos             _U_(19)                                              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR15_WRUSERH3_Msk             (_U_(0x1) << MATRIX_PSR15_WRUSERH3_Pos)              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_WRUSERH3(value)          (MATRIX_PSR15_WRUSERH3_Msk & ((value) << MATRIX_PSR15_WRUSERH3_Pos))
#define MATRIX_PSR15_WRUSERH4_Pos             _U_(20)                                              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR15_WRUSERH4_Msk             (_U_(0x1) << MATRIX_PSR15_WRUSERH4_Pos)              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_WRUSERH4(value)          (MATRIX_PSR15_WRUSERH4_Msk & ((value) << MATRIX_PSR15_WRUSERH4_Pos))
#define MATRIX_PSR15_WRUSERH5_Pos             _U_(21)                                              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR15_WRUSERH5_Msk             (_U_(0x1) << MATRIX_PSR15_WRUSERH5_Pos)              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_WRUSERH5(value)          (MATRIX_PSR15_WRUSERH5_Msk & ((value) << MATRIX_PSR15_WRUSERH5_Pos))
#define MATRIX_PSR15_WRUSERH6_Pos             _U_(22)                                              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR15_WRUSERH6_Msk             (_U_(0x1) << MATRIX_PSR15_WRUSERH6_Pos)              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_WRUSERH6(value)          (MATRIX_PSR15_WRUSERH6_Msk & ((value) << MATRIX_PSR15_WRUSERH6_Pos))
#define MATRIX_PSR15_WRUSERH7_Pos             _U_(23)                                              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Position */
#define MATRIX_PSR15_WRUSERH7_Msk             (_U_(0x1) << MATRIX_PSR15_WRUSERH7_Pos)              /**< (MATRIX_PSR15) Write USER for HSELx Protected Region Mask */
#define MATRIX_PSR15_WRUSERH7(value)          (MATRIX_PSR15_WRUSERH7_Msk & ((value) << MATRIX_PSR15_WRUSERH7_Pos))
#define MATRIX_PSR15_DPSOA0_Pos               _U_(24)                                              /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR15_DPSOA0_Msk               (_U_(0x1) << MATRIX_PSR15_DPSOA0_Pos)                /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR15_DPSOA0(value)            (MATRIX_PSR15_DPSOA0_Msk & ((value) << MATRIX_PSR15_DPSOA0_Pos))
#define MATRIX_PSR15_DPSOA1_Pos               _U_(25)                                              /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR15_DPSOA1_Msk               (_U_(0x1) << MATRIX_PSR15_DPSOA1_Pos)                /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR15_DPSOA1(value)            (MATRIX_PSR15_DPSOA1_Msk & ((value) << MATRIX_PSR15_DPSOA1_Pos))
#define MATRIX_PSR15_DPSOA2_Pos               _U_(26)                                              /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR15_DPSOA2_Msk               (_U_(0x1) << MATRIX_PSR15_DPSOA2_Pos)                /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR15_DPSOA2(value)            (MATRIX_PSR15_DPSOA2_Msk & ((value) << MATRIX_PSR15_DPSOA2_Pos))
#define MATRIX_PSR15_DPSOA3_Pos               _U_(27)                                              /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR15_DPSOA3_Msk               (_U_(0x1) << MATRIX_PSR15_DPSOA3_Pos)                /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR15_DPSOA3(value)            (MATRIX_PSR15_DPSOA3_Msk & ((value) << MATRIX_PSR15_DPSOA3_Pos))
#define MATRIX_PSR15_DPSOA4_Pos               _U_(28)                                              /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR15_DPSOA4_Msk               (_U_(0x1) << MATRIX_PSR15_DPSOA4_Pos)                /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR15_DPSOA4(value)            (MATRIX_PSR15_DPSOA4_Msk & ((value) << MATRIX_PSR15_DPSOA4_Pos))
#define MATRIX_PSR15_DPSOA5_Pos               _U_(29)                                              /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR15_DPSOA5_Msk               (_U_(0x1) << MATRIX_PSR15_DPSOA5_Pos)                /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR15_DPSOA5(value)            (MATRIX_PSR15_DPSOA5_Msk & ((value) << MATRIX_PSR15_DPSOA5_Pos))
#define MATRIX_PSR15_DPSOA6_Pos               _U_(30)                                              /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR15_DPSOA6_Msk               (_U_(0x1) << MATRIX_PSR15_DPSOA6_Pos)                /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR15_DPSOA6(value)            (MATRIX_PSR15_DPSOA6_Msk & ((value) << MATRIX_PSR15_DPSOA6_Pos))
#define MATRIX_PSR15_DPSOA7_Pos               _U_(31)                                              /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Position */
#define MATRIX_PSR15_DPSOA7_Msk               (_U_(0x1) << MATRIX_PSR15_DPSOA7_Pos)                /**< (MATRIX_PSR15) Downward Protection Split Address for HSELx Protected Region Mask */
#define MATRIX_PSR15_DPSOA7(value)            (MATRIX_PSR15_DPSOA7_Msk & ((value) << MATRIX_PSR15_DPSOA7_Pos))
#define MATRIX_PSR15_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_PSR15) Register Mask  */

#define MATRIX_PSR15_LAUSERH_Pos              _U_(0)                                               /**< (MATRIX_PSR15 Position) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR15_LAUSERH_Msk              (_U_(0xFF) << MATRIX_PSR15_LAUSERH_Pos)              /**< (MATRIX_PSR15 Mask) LAUSERH */
#define MATRIX_PSR15_LAUSERH(value)           (MATRIX_PSR15_LAUSERH_Msk & ((value) << MATRIX_PSR15_LAUSERH_Pos)) 
#define MATRIX_PSR15_RDUSERH_Pos              _U_(8)                                               /**< (MATRIX_PSR15 Position) Read USER for HSELx Protected Region */
#define MATRIX_PSR15_RDUSERH_Msk              (_U_(0xFF) << MATRIX_PSR15_RDUSERH_Pos)              /**< (MATRIX_PSR15 Mask) RDUSERH */
#define MATRIX_PSR15_RDUSERH(value)           (MATRIX_PSR15_RDUSERH_Msk & ((value) << MATRIX_PSR15_RDUSERH_Pos)) 
#define MATRIX_PSR15_WRUSERH_Pos              _U_(16)                                              /**< (MATRIX_PSR15 Position) Write USER for HSELx Protected Region */
#define MATRIX_PSR15_WRUSERH_Msk              (_U_(0xFF) << MATRIX_PSR15_WRUSERH_Pos)              /**< (MATRIX_PSR15 Mask) WRUSERH */
#define MATRIX_PSR15_WRUSERH(value)           (MATRIX_PSR15_WRUSERH_Msk & ((value) << MATRIX_PSR15_WRUSERH_Pos)) 
#define MATRIX_PSR15_DPSOA_Pos                _U_(24)                                              /**< (MATRIX_PSR15 Position) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR15_DPSOA_Msk                (_U_(0xFF) << MATRIX_PSR15_DPSOA_Pos)                /**< (MATRIX_PSR15 Mask) DPSOA */
#define MATRIX_PSR15_DPSOA(value)             (MATRIX_PSR15_DPSOA_Msk & ((value) << MATRIX_PSR15_DPSOA_Pos)) 

/* -------- MATRIX_PASSR0 : (MATRIX Offset: 0x240) (R/W 32) Protected Areas Split Slave 0 Register 0 -------- */
#define MATRIX_PASSR0_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR0_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR0_PASPLIT0_Pos)             /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR0_PASPLIT0(value)         (MATRIX_PASSR0_PASPLIT0_Msk & ((value) << MATRIX_PASSR0_PASPLIT0_Pos))
#define MATRIX_PASSR0_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR0_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR0_PASPLIT1_Pos)             /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR0_PASPLIT1(value)         (MATRIX_PASSR0_PASPLIT1_Msk & ((value) << MATRIX_PASSR0_PASPLIT1_Pos))
#define MATRIX_PASSR0_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR0_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR0_PASPLIT2_Pos)             /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR0_PASPLIT2(value)         (MATRIX_PASSR0_PASPLIT2_Msk & ((value) << MATRIX_PASSR0_PASPLIT2_Pos))
#define MATRIX_PASSR0_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR0_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR0_PASPLIT3_Pos)             /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR0_PASPLIT3(value)         (MATRIX_PASSR0_PASPLIT3_Msk & ((value) << MATRIX_PASSR0_PASPLIT3_Pos))
#define MATRIX_PASSR0_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR0_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR0_PASPLIT4_Pos)             /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR0_PASPLIT4(value)         (MATRIX_PASSR0_PASPLIT4_Msk & ((value) << MATRIX_PASSR0_PASPLIT4_Pos))
#define MATRIX_PASSR0_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR0_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR0_PASPLIT5_Pos)             /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR0_PASPLIT5(value)         (MATRIX_PASSR0_PASPLIT5_Msk & ((value) << MATRIX_PASSR0_PASPLIT5_Pos))
#define MATRIX_PASSR0_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR0_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR0_PASPLIT6_Pos)             /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR0_PASPLIT6(value)         (MATRIX_PASSR0_PASPLIT6_Msk & ((value) << MATRIX_PASSR0_PASPLIT6_Pos))
#define MATRIX_PASSR0_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR0_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR0_PASPLIT7_Pos)             /**< (MATRIX_PASSR0) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR0_PASPLIT7(value)         (MATRIX_PASSR0_PASPLIT7_Msk & ((value) << MATRIX_PASSR0_PASPLIT7_Pos))
#define MATRIX_PASSR0_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR0) Register Mask  */


