Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_PASSR1 : (MATRIX Offset: 0x244) (R/W 32) Protected Areas Split Slave 0 Register 1 -------- */
#define MATRIX_PASSR1_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR1_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR1_PASPLIT0_Pos)             /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR1_PASPLIT0(value)         (MATRIX_PASSR1_PASPLIT0_Msk & ((value) << MATRIX_PASSR1_PASPLIT0_Pos))
#define MATRIX_PASSR1_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR1_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR1_PASPLIT1_Pos)             /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR1_PASPLIT1(value)         (MATRIX_PASSR1_PASPLIT1_Msk & ((value) << MATRIX_PASSR1_PASPLIT1_Pos))
#define MATRIX_PASSR1_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR1_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR1_PASPLIT2_Pos)             /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR1_PASPLIT2(value)         (MATRIX_PASSR1_PASPLIT2_Msk & ((value) << MATRIX_PASSR1_PASPLIT2_Pos))
#define MATRIX_PASSR1_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR1_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR1_PASPLIT3_Pos)             /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR1_PASPLIT3(value)         (MATRIX_PASSR1_PASPLIT3_Msk & ((value) << MATRIX_PASSR1_PASPLIT3_Pos))
#define MATRIX_PASSR1_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR1_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR1_PASPLIT4_Pos)             /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR1_PASPLIT4(value)         (MATRIX_PASSR1_PASPLIT4_Msk & ((value) << MATRIX_PASSR1_PASPLIT4_Pos))
#define MATRIX_PASSR1_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR1_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR1_PASPLIT5_Pos)             /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR1_PASPLIT5(value)         (MATRIX_PASSR1_PASPLIT5_Msk & ((value) << MATRIX_PASSR1_PASPLIT5_Pos))
#define MATRIX_PASSR1_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR1_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR1_PASPLIT6_Pos)             /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR1_PASPLIT6(value)         (MATRIX_PASSR1_PASPLIT6_Msk & ((value) << MATRIX_PASSR1_PASPLIT6_Pos))
#define MATRIX_PASSR1_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR1_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR1_PASPLIT7_Pos)             /**< (MATRIX_PASSR1) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR1_PASPLIT7(value)         (MATRIX_PASSR1_PASPLIT7_Msk & ((value) << MATRIX_PASSR1_PASPLIT7_Pos))
#define MATRIX_PASSR1_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR1) Register Mask  */


/* -------- MATRIX_PASSR2 : (MATRIX Offset: 0x248) (R/W 32) Protected Areas Split Slave 0 Register 2 -------- */
#define MATRIX_PASSR2_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR2_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR2_PASPLIT0_Pos)             /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR2_PASPLIT0(value)         (MATRIX_PASSR2_PASPLIT0_Msk & ((value) << MATRIX_PASSR2_PASPLIT0_Pos))
#define MATRIX_PASSR2_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR2_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR2_PASPLIT1_Pos)             /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR2_PASPLIT1(value)         (MATRIX_PASSR2_PASPLIT1_Msk & ((value) << MATRIX_PASSR2_PASPLIT1_Pos))
#define MATRIX_PASSR2_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR2_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR2_PASPLIT2_Pos)             /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR2_PASPLIT2(value)         (MATRIX_PASSR2_PASPLIT2_Msk & ((value) << MATRIX_PASSR2_PASPLIT2_Pos))
#define MATRIX_PASSR2_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR2_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR2_PASPLIT3_Pos)             /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR2_PASPLIT3(value)         (MATRIX_PASSR2_PASPLIT3_Msk & ((value) << MATRIX_PASSR2_PASPLIT3_Pos))
#define MATRIX_PASSR2_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR2_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR2_PASPLIT4_Pos)             /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR2_PASPLIT4(value)         (MATRIX_PASSR2_PASPLIT4_Msk & ((value) << MATRIX_PASSR2_PASPLIT4_Pos))
#define MATRIX_PASSR2_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR2_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR2_PASPLIT5_Pos)             /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR2_PASPLIT5(value)         (MATRIX_PASSR2_PASPLIT5_Msk & ((value) << MATRIX_PASSR2_PASPLIT5_Pos))
#define MATRIX_PASSR2_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR2_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR2_PASPLIT6_Pos)             /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR2_PASPLIT6(value)         (MATRIX_PASSR2_PASPLIT6_Msk & ((value) << MATRIX_PASSR2_PASPLIT6_Pos))
#define MATRIX_PASSR2_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR2_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR2_PASPLIT7_Pos)             /**< (MATRIX_PASSR2) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR2_PASPLIT7(value)         (MATRIX_PASSR2_PASPLIT7_Msk & ((value) << MATRIX_PASSR2_PASPLIT7_Pos))
#define MATRIX_PASSR2_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR2) Register Mask  */


/* -------- MATRIX_PASSR3 : (MATRIX Offset: 0x24C) (R/W 32) Protected Areas Split Slave 0 Register 3 -------- */
#define MATRIX_PASSR3_PASPLIT0_Pos            _U_(0)                                               /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR3_PASPLIT0_Msk            (_U_(0xF) << MATRIX_PASSR3_PASPLIT0_Pos)             /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR3_PASPLIT0(value)         (MATRIX_PASSR3_PASPLIT0_Msk & ((value) << MATRIX_PASSR3_PASPLIT0_Pos))
#define MATRIX_PASSR3_PASPLIT1_Pos            _U_(4)                                               /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR3_PASPLIT1_Msk            (_U_(0xF) << MATRIX_PASSR3_PASPLIT1_Pos)             /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR3_PASPLIT1(value)         (MATRIX_PASSR3_PASPLIT1_Msk & ((value) << MATRIX_PASSR3_PASPLIT1_Pos))
#define MATRIX_PASSR3_PASPLIT2_Pos            _U_(8)                                               /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR3_PASPLIT2_Msk            (_U_(0xF) << MATRIX_PASSR3_PASPLIT2_Pos)             /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR3_PASPLIT2(value)         (MATRIX_PASSR3_PASPLIT2_Msk & ((value) << MATRIX_PASSR3_PASPLIT2_Pos))
#define MATRIX_PASSR3_PASPLIT3_Pos            _U_(12)                                              /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR3_PASPLIT3_Msk            (_U_(0xF) << MATRIX_PASSR3_PASPLIT3_Pos)             /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR3_PASPLIT3(value)         (MATRIX_PASSR3_PASPLIT3_Msk & ((value) << MATRIX_PASSR3_PASPLIT3_Pos))
#define MATRIX_PASSR3_PASPLIT4_Pos            _U_(16)                                              /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR3_PASPLIT4_Msk            (_U_(0xF) << MATRIX_PASSR3_PASPLIT4_Pos)             /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR3_PASPLIT4(value)         (MATRIX_PASSR3_PASPLIT4_Msk & ((value) << MATRIX_PASSR3_PASPLIT4_Pos))
#define MATRIX_PASSR3_PASPLIT5_Pos            _U_(20)                                              /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR3_PASPLIT5_Msk            (_U_(0xF) << MATRIX_PASSR3_PASPLIT5_Pos)             /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR3_PASPLIT5(value)         (MATRIX_PASSR3_PASPLIT5_Msk & ((value) << MATRIX_PASSR3_PASPLIT5_Pos))
#define MATRIX_PASSR3_PASPLIT6_Pos            _U_(24)                                              /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR3_PASPLIT6_Msk            (_U_(0xF) << MATRIX_PASSR3_PASPLIT6_Pos)             /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR3_PASPLIT6(value)         (MATRIX_PASSR3_PASPLIT6_Msk & ((value) << MATRIX_PASSR3_PASPLIT6_Pos))
#define MATRIX_PASSR3_PASPLIT7_Pos            _U_(28)                                              /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Position */
#define MATRIX_PASSR3_PASPLIT7_Msk            (_U_(0xF) << MATRIX_PASSR3_PASPLIT7_Pos)             /**< (MATRIX_PASSR3) Protected Areas Split for HSELx Protected Region Mask */
#define MATRIX_PASSR3_PASPLIT7(value)         (MATRIX_PASSR3_PASPLIT7_Msk & ((value) << MATRIX_PASSR3_PASPLIT7_Pos))
#define MATRIX_PASSR3_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PASSR3) Register Mask  */


