Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_PRTSR4 : (MATRIX Offset: 0x290) (R/W 32) Protected Region Top Slave 0 Register 4 -------- */
#define MATRIX_PRTSR4_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Position */
#define MATRIX_PRTSR4_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR4_PRTOP0_Pos)               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR4_PRTOP0(value)           (MATRIX_PRTSR4_PRTOP0_Msk & ((value) << MATRIX_PRTSR4_PRTOP0_Pos))
#define MATRIX_PRTSR4_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Position */
#define MATRIX_PRTSR4_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR4_PRTOP1_Pos)               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR4_PRTOP1(value)           (MATRIX_PRTSR4_PRTOP1_Msk & ((value) << MATRIX_PRTSR4_PRTOP1_Pos))
#define MATRIX_PRTSR4_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Position */
#define MATRIX_PRTSR4_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR4_PRTOP2_Pos)               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR4_PRTOP2(value)           (MATRIX_PRTSR4_PRTOP2_Msk & ((value) << MATRIX_PRTSR4_PRTOP2_Pos))
#define MATRIX_PRTSR4_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR4) HSELx Protected Region Top Position */
#define MATRIX_PRTSR4_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR4_PRTOP3_Pos)               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR4_PRTOP3(value)           (MATRIX_PRTSR4_PRTOP3_Msk & ((value) << MATRIX_PRTSR4_PRTOP3_Pos))
#define MATRIX_PRTSR4_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR4) HSELx Protected Region Top Position */
#define MATRIX_PRTSR4_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR4_PRTOP4_Pos)               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR4_PRTOP4(value)           (MATRIX_PRTSR4_PRTOP4_Msk & ((value) << MATRIX_PRTSR4_PRTOP4_Pos))
#define MATRIX_PRTSR4_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR4) HSELx Protected Region Top Position */
#define MATRIX_PRTSR4_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR4_PRTOP5_Pos)               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR4_PRTOP5(value)           (MATRIX_PRTSR4_PRTOP5_Msk & ((value) << MATRIX_PRTSR4_PRTOP5_Pos))
#define MATRIX_PRTSR4_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR4) HSELx Protected Region Top Position */
#define MATRIX_PRTSR4_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR4_PRTOP6_Pos)               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR4_PRTOP6(value)           (MATRIX_PRTSR4_PRTOP6_Msk & ((value) << MATRIX_PRTSR4_PRTOP6_Pos))
#define MATRIX_PRTSR4_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR4) HSELx Protected Region Top Position */
#define MATRIX_PRTSR4_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR4_PRTOP7_Pos)               /**< (MATRIX_PRTSR4) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR4_PRTOP7(value)           (MATRIX_PRTSR4_PRTOP7_Msk & ((value) << MATRIX_PRTSR4_PRTOP7_Pos))
#define MATRIX_PRTSR4_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR4) Register Mask  */


/* -------- MATRIX_PRTSR5 : (MATRIX Offset: 0x294) (R/W 32) Protected Region Top Slave 0 Register 5 -------- */
#define MATRIX_PRTSR5_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Position */
#define MATRIX_PRTSR5_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR5_PRTOP0_Pos)               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR5_PRTOP0(value)           (MATRIX_PRTSR5_PRTOP0_Msk & ((value) << MATRIX_PRTSR5_PRTOP0_Pos))
#define MATRIX_PRTSR5_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Position */
#define MATRIX_PRTSR5_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR5_PRTOP1_Pos)               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR5_PRTOP1(value)           (MATRIX_PRTSR5_PRTOP1_Msk & ((value) << MATRIX_PRTSR5_PRTOP1_Pos))
#define MATRIX_PRTSR5_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Position */
#define MATRIX_PRTSR5_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR5_PRTOP2_Pos)               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR5_PRTOP2(value)           (MATRIX_PRTSR5_PRTOP2_Msk & ((value) << MATRIX_PRTSR5_PRTOP2_Pos))
#define MATRIX_PRTSR5_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR5) HSELx Protected Region Top Position */
#define MATRIX_PRTSR5_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR5_PRTOP3_Pos)               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR5_PRTOP3(value)           (MATRIX_PRTSR5_PRTOP3_Msk & ((value) << MATRIX_PRTSR5_PRTOP3_Pos))
#define MATRIX_PRTSR5_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR5) HSELx Protected Region Top Position */
#define MATRIX_PRTSR5_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR5_PRTOP4_Pos)               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR5_PRTOP4(value)           (MATRIX_PRTSR5_PRTOP4_Msk & ((value) << MATRIX_PRTSR5_PRTOP4_Pos))
#define MATRIX_PRTSR5_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR5) HSELx Protected Region Top Position */
#define MATRIX_PRTSR5_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR5_PRTOP5_Pos)               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR5_PRTOP5(value)           (MATRIX_PRTSR5_PRTOP5_Msk & ((value) << MATRIX_PRTSR5_PRTOP5_Pos))
#define MATRIX_PRTSR5_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR5) HSELx Protected Region Top Position */
#define MATRIX_PRTSR5_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR5_PRTOP6_Pos)               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR5_PRTOP6(value)           (MATRIX_PRTSR5_PRTOP6_Msk & ((value) << MATRIX_PRTSR5_PRTOP6_Pos))
#define MATRIX_PRTSR5_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR5) HSELx Protected Region Top Position */
#define MATRIX_PRTSR5_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR5_PRTOP7_Pos)               /**< (MATRIX_PRTSR5) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR5_PRTOP7(value)           (MATRIX_PRTSR5_PRTOP7_Msk & ((value) << MATRIX_PRTSR5_PRTOP7_Pos))
#define MATRIX_PRTSR5_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR5) Register Mask  */


/* -------- MATRIX_PRTSR6 : (MATRIX Offset: 0x298) (R/W 32) Protected Region Top Slave 0 Register 6 -------- */
#define MATRIX_PRTSR6_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Position */
#define MATRIX_PRTSR6_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR6_PRTOP0_Pos)               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR6_PRTOP0(value)           (MATRIX_PRTSR6_PRTOP0_Msk & ((value) << MATRIX_PRTSR6_PRTOP0_Pos))
#define MATRIX_PRTSR6_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Position */
#define MATRIX_PRTSR6_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR6_PRTOP1_Pos)               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR6_PRTOP1(value)           (MATRIX_PRTSR6_PRTOP1_Msk & ((value) << MATRIX_PRTSR6_PRTOP1_Pos))
#define MATRIX_PRTSR6_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Position */
#define MATRIX_PRTSR6_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR6_PRTOP2_Pos)               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR6_PRTOP2(value)           (MATRIX_PRTSR6_PRTOP2_Msk & ((value) << MATRIX_PRTSR6_PRTOP2_Pos))
#define MATRIX_PRTSR6_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR6) HSELx Protected Region Top Position */
#define MATRIX_PRTSR6_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR6_PRTOP3_Pos)               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR6_PRTOP3(value)           (MATRIX_PRTSR6_PRTOP3_Msk & ((value) << MATRIX_PRTSR6_PRTOP3_Pos))
#define MATRIX_PRTSR6_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR6) HSELx Protected Region Top Position */
#define MATRIX_PRTSR6_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR6_PRTOP4_Pos)               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR6_PRTOP4(value)           (MATRIX_PRTSR6_PRTOP4_Msk & ((value) << MATRIX_PRTSR6_PRTOP4_Pos))
#define MATRIX_PRTSR6_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR6) HSELx Protected Region Top Position */
#define MATRIX_PRTSR6_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR6_PRTOP5_Pos)               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR6_PRTOP5(value)           (MATRIX_PRTSR6_PRTOP5_Msk & ((value) << MATRIX_PRTSR6_PRTOP5_Pos))
#define MATRIX_PRTSR6_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR6) HSELx Protected Region Top Position */
#define MATRIX_PRTSR6_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR6_PRTOP6_Pos)               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR6_PRTOP6(value)           (MATRIX_PRTSR6_PRTOP6_Msk & ((value) << MATRIX_PRTSR6_PRTOP6_Pos))
#define MATRIX_PRTSR6_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR6) HSELx Protected Region Top Position */
#define MATRIX_PRTSR6_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR6_PRTOP7_Pos)               /**< (MATRIX_PRTSR6) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR6_PRTOP7(value)           (MATRIX_PRTSR6_PRTOP7_Msk & ((value) << MATRIX_PRTSR6_PRTOP7_Pos))
#define MATRIX_PRTSR6_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR6) Register Mask  */


/* -------- MATRIX_PRTSR7 : (MATRIX Offset: 0x29C) (R/W 32) Protected Region Top Slave 0 Register 7 -------- */
#define MATRIX_PRTSR7_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Position */
#define MATRIX_PRTSR7_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR7_PRTOP0_Pos)               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR7_PRTOP0(value)           (MATRIX_PRTSR7_PRTOP0_Msk & ((value) << MATRIX_PRTSR7_PRTOP0_Pos))
#define MATRIX_PRTSR7_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Position */
#define MATRIX_PRTSR7_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR7_PRTOP1_Pos)               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR7_PRTOP1(value)           (MATRIX_PRTSR7_PRTOP1_Msk & ((value) << MATRIX_PRTSR7_PRTOP1_Pos))
#define MATRIX_PRTSR7_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Position */
#define MATRIX_PRTSR7_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR7_PRTOP2_Pos)               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR7_PRTOP2(value)           (MATRIX_PRTSR7_PRTOP2_Msk & ((value) << MATRIX_PRTSR7_PRTOP2_Pos))
#define MATRIX_PRTSR7_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR7) HSELx Protected Region Top Position */
#define MATRIX_PRTSR7_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR7_PRTOP3_Pos)               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR7_PRTOP3(value)           (MATRIX_PRTSR7_PRTOP3_Msk & ((value) << MATRIX_PRTSR7_PRTOP3_Pos))
#define MATRIX_PRTSR7_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR7) HSELx Protected Region Top Position */
#define MATRIX_PRTSR7_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR7_PRTOP4_Pos)               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR7_PRTOP4(value)           (MATRIX_PRTSR7_PRTOP4_Msk & ((value) << MATRIX_PRTSR7_PRTOP4_Pos))
#define MATRIX_PRTSR7_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR7) HSELx Protected Region Top Position */
#define MATRIX_PRTSR7_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR7_PRTOP5_Pos)               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR7_PRTOP5(value)           (MATRIX_PRTSR7_PRTOP5_Msk & ((value) << MATRIX_PRTSR7_PRTOP5_Pos))
#define MATRIX_PRTSR7_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR7) HSELx Protected Region Top Position */
#define MATRIX_PRTSR7_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR7_PRTOP6_Pos)               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR7_PRTOP6(value)           (MATRIX_PRTSR7_PRTOP6_Msk & ((value) << MATRIX_PRTSR7_PRTOP6_Pos))
#define MATRIX_PRTSR7_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR7) HSELx Protected Region Top Position */
#define MATRIX_PRTSR7_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR7_PRTOP7_Pos)               /**< (MATRIX_PRTSR7) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR7_PRTOP7(value)           (MATRIX_PRTSR7_PRTOP7_Msk & ((value) << MATRIX_PRTSR7_PRTOP7_Pos))
#define MATRIX_PRTSR7_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR7) Register Mask  */


