Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_PRTSR8 : (MATRIX Offset: 0x2A0) (R/W 32) Protected Region Top Slave 0 Register 8 -------- */
#define MATRIX_PRTSR8_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Position */
#define MATRIX_PRTSR8_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR8_PRTOP0_Pos)               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR8_PRTOP0(value)           (MATRIX_PRTSR8_PRTOP0_Msk & ((value) << MATRIX_PRTSR8_PRTOP0_Pos))
#define MATRIX_PRTSR8_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Position */
#define MATRIX_PRTSR8_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR8_PRTOP1_Pos)               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR8_PRTOP1(value)           (MATRIX_PRTSR8_PRTOP1_Msk & ((value) << MATRIX_PRTSR8_PRTOP1_Pos))
#define MATRIX_PRTSR8_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Position */
#define MATRIX_PRTSR8_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR8_PRTOP2_Pos)               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR8_PRTOP2(value)           (MATRIX_PRTSR8_PRTOP2_Msk & ((value) << MATRIX_PRTSR8_PRTOP2_Pos))
#define MATRIX_PRTSR8_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR8) HSELx Protected Region Top Position */
#define MATRIX_PRTSR8_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR8_PRTOP3_Pos)               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR8_PRTOP3(value)           (MATRIX_PRTSR8_PRTOP3_Msk & ((value) << MATRIX_PRTSR8_PRTOP3_Pos))
#define MATRIX_PRTSR8_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR8) HSELx Protected Region Top Position */
#define MATRIX_PRTSR8_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR8_PRTOP4_Pos)               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR8_PRTOP4(value)           (MATRIX_PRTSR8_PRTOP4_Msk & ((value) << MATRIX_PRTSR8_PRTOP4_Pos))
#define MATRIX_PRTSR8_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR8) HSELx Protected Region Top Position */
#define MATRIX_PRTSR8_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR8_PRTOP5_Pos)               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR8_PRTOP5(value)           (MATRIX_PRTSR8_PRTOP5_Msk & ((value) << MATRIX_PRTSR8_PRTOP5_Pos))
#define MATRIX_PRTSR8_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR8) HSELx Protected Region Top Position */
#define MATRIX_PRTSR8_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR8_PRTOP6_Pos)               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR8_PRTOP6(value)           (MATRIX_PRTSR8_PRTOP6_Msk & ((value) << MATRIX_PRTSR8_PRTOP6_Pos))
#define MATRIX_PRTSR8_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR8) HSELx Protected Region Top Position */
#define MATRIX_PRTSR8_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR8_PRTOP7_Pos)               /**< (MATRIX_PRTSR8) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR8_PRTOP7(value)           (MATRIX_PRTSR8_PRTOP7_Msk & ((value) << MATRIX_PRTSR8_PRTOP7_Pos))
#define MATRIX_PRTSR8_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR8) Register Mask  */


/* -------- MATRIX_PRTSR9 : (MATRIX Offset: 0x2A4) (R/W 32) Protected Region Top Slave 0 Register 9 -------- */
#define MATRIX_PRTSR9_PRTOP0_Pos              _U_(0)                                               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Position */
#define MATRIX_PRTSR9_PRTOP0_Msk              (_U_(0xF) << MATRIX_PRTSR9_PRTOP0_Pos)               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR9_PRTOP0(value)           (MATRIX_PRTSR9_PRTOP0_Msk & ((value) << MATRIX_PRTSR9_PRTOP0_Pos))
#define MATRIX_PRTSR9_PRTOP1_Pos              _U_(4)                                               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Position */
#define MATRIX_PRTSR9_PRTOP1_Msk              (_U_(0xF) << MATRIX_PRTSR9_PRTOP1_Pos)               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR9_PRTOP1(value)           (MATRIX_PRTSR9_PRTOP1_Msk & ((value) << MATRIX_PRTSR9_PRTOP1_Pos))
#define MATRIX_PRTSR9_PRTOP2_Pos              _U_(8)                                               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Position */
#define MATRIX_PRTSR9_PRTOP2_Msk              (_U_(0xF) << MATRIX_PRTSR9_PRTOP2_Pos)               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR9_PRTOP2(value)           (MATRIX_PRTSR9_PRTOP2_Msk & ((value) << MATRIX_PRTSR9_PRTOP2_Pos))
#define MATRIX_PRTSR9_PRTOP3_Pos              _U_(12)                                              /**< (MATRIX_PRTSR9) HSELx Protected Region Top Position */
#define MATRIX_PRTSR9_PRTOP3_Msk              (_U_(0xF) << MATRIX_PRTSR9_PRTOP3_Pos)               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR9_PRTOP3(value)           (MATRIX_PRTSR9_PRTOP3_Msk & ((value) << MATRIX_PRTSR9_PRTOP3_Pos))
#define MATRIX_PRTSR9_PRTOP4_Pos              _U_(16)                                              /**< (MATRIX_PRTSR9) HSELx Protected Region Top Position */
#define MATRIX_PRTSR9_PRTOP4_Msk              (_U_(0xF) << MATRIX_PRTSR9_PRTOP4_Pos)               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR9_PRTOP4(value)           (MATRIX_PRTSR9_PRTOP4_Msk & ((value) << MATRIX_PRTSR9_PRTOP4_Pos))
#define MATRIX_PRTSR9_PRTOP5_Pos              _U_(20)                                              /**< (MATRIX_PRTSR9) HSELx Protected Region Top Position */
#define MATRIX_PRTSR9_PRTOP5_Msk              (_U_(0xF) << MATRIX_PRTSR9_PRTOP5_Pos)               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR9_PRTOP5(value)           (MATRIX_PRTSR9_PRTOP5_Msk & ((value) << MATRIX_PRTSR9_PRTOP5_Pos))
#define MATRIX_PRTSR9_PRTOP6_Pos              _U_(24)                                              /**< (MATRIX_PRTSR9) HSELx Protected Region Top Position */
#define MATRIX_PRTSR9_PRTOP6_Msk              (_U_(0xF) << MATRIX_PRTSR9_PRTOP6_Pos)               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR9_PRTOP6(value)           (MATRIX_PRTSR9_PRTOP6_Msk & ((value) << MATRIX_PRTSR9_PRTOP6_Pos))
#define MATRIX_PRTSR9_PRTOP7_Pos              _U_(28)                                              /**< (MATRIX_PRTSR9) HSELx Protected Region Top Position */
#define MATRIX_PRTSR9_PRTOP7_Msk              (_U_(0xF) << MATRIX_PRTSR9_PRTOP7_Pos)               /**< (MATRIX_PRTSR9) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR9_PRTOP7(value)           (MATRIX_PRTSR9_PRTOP7_Msk & ((value) << MATRIX_PRTSR9_PRTOP7_Pos))
#define MATRIX_PRTSR9_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR9) Register Mask  */


/* -------- MATRIX_PRTSR10 : (MATRIX Offset: 0x2A8) (R/W 32) Protected Region Top Slave 0 Register 10 -------- */
#define MATRIX_PRTSR10_PRTOP0_Pos             _U_(0)                                               /**< (MATRIX_PRTSR10) HSELx Protected Region Top Position */
#define MATRIX_PRTSR10_PRTOP0_Msk             (_U_(0xF) << MATRIX_PRTSR10_PRTOP0_Pos)              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR10_PRTOP0(value)          (MATRIX_PRTSR10_PRTOP0_Msk & ((value) << MATRIX_PRTSR10_PRTOP0_Pos))
#define MATRIX_PRTSR10_PRTOP1_Pos             _U_(4)                                               /**< (MATRIX_PRTSR10) HSELx Protected Region Top Position */
#define MATRIX_PRTSR10_PRTOP1_Msk             (_U_(0xF) << MATRIX_PRTSR10_PRTOP1_Pos)              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR10_PRTOP1(value)          (MATRIX_PRTSR10_PRTOP1_Msk & ((value) << MATRIX_PRTSR10_PRTOP1_Pos))
#define MATRIX_PRTSR10_PRTOP2_Pos             _U_(8)                                               /**< (MATRIX_PRTSR10) HSELx Protected Region Top Position */
#define MATRIX_PRTSR10_PRTOP2_Msk             (_U_(0xF) << MATRIX_PRTSR10_PRTOP2_Pos)              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR10_PRTOP2(value)          (MATRIX_PRTSR10_PRTOP2_Msk & ((value) << MATRIX_PRTSR10_PRTOP2_Pos))
#define MATRIX_PRTSR10_PRTOP3_Pos             _U_(12)                                              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Position */
#define MATRIX_PRTSR10_PRTOP3_Msk             (_U_(0xF) << MATRIX_PRTSR10_PRTOP3_Pos)              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR10_PRTOP3(value)          (MATRIX_PRTSR10_PRTOP3_Msk & ((value) << MATRIX_PRTSR10_PRTOP3_Pos))
#define MATRIX_PRTSR10_PRTOP4_Pos             _U_(16)                                              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Position */
#define MATRIX_PRTSR10_PRTOP4_Msk             (_U_(0xF) << MATRIX_PRTSR10_PRTOP4_Pos)              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR10_PRTOP4(value)          (MATRIX_PRTSR10_PRTOP4_Msk & ((value) << MATRIX_PRTSR10_PRTOP4_Pos))
#define MATRIX_PRTSR10_PRTOP5_Pos             _U_(20)                                              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Position */
#define MATRIX_PRTSR10_PRTOP5_Msk             (_U_(0xF) << MATRIX_PRTSR10_PRTOP5_Pos)              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR10_PRTOP5(value)          (MATRIX_PRTSR10_PRTOP5_Msk & ((value) << MATRIX_PRTSR10_PRTOP5_Pos))
#define MATRIX_PRTSR10_PRTOP6_Pos             _U_(24)                                              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Position */
#define MATRIX_PRTSR10_PRTOP6_Msk             (_U_(0xF) << MATRIX_PRTSR10_PRTOP6_Pos)              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR10_PRTOP6(value)          (MATRIX_PRTSR10_PRTOP6_Msk & ((value) << MATRIX_PRTSR10_PRTOP6_Pos))
#define MATRIX_PRTSR10_PRTOP7_Pos             _U_(28)                                              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Position */
#define MATRIX_PRTSR10_PRTOP7_Msk             (_U_(0xF) << MATRIX_PRTSR10_PRTOP7_Pos)              /**< (MATRIX_PRTSR10) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR10_PRTOP7(value)          (MATRIX_PRTSR10_PRTOP7_Msk & ((value) << MATRIX_PRTSR10_PRTOP7_Pos))
#define MATRIX_PRTSR10_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR10) Register Mask  */


