Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_PRTSR11 : (MATRIX Offset: 0x2AC) (R/W 32) Protected Region Top Slave 0 Register 11 -------- */
#define MATRIX_PRTSR11_PRTOP0_Pos             _U_(0)                                               /**< (MATRIX_PRTSR11) HSELx Protected Region Top Position */
#define MATRIX_PRTSR11_PRTOP0_Msk             (_U_(0xF) << MATRIX_PRTSR11_PRTOP0_Pos)              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR11_PRTOP0(value)          (MATRIX_PRTSR11_PRTOP0_Msk & ((value) << MATRIX_PRTSR11_PRTOP0_Pos))
#define MATRIX_PRTSR11_PRTOP1_Pos             _U_(4)                                               /**< (MATRIX_PRTSR11) HSELx Protected Region Top Position */
#define MATRIX_PRTSR11_PRTOP1_Msk             (_U_(0xF) << MATRIX_PRTSR11_PRTOP1_Pos)              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR11_PRTOP1(value)          (MATRIX_PRTSR11_PRTOP1_Msk & ((value) << MATRIX_PRTSR11_PRTOP1_Pos))
#define MATRIX_PRTSR11_PRTOP2_Pos             _U_(8)                                               /**< (MATRIX_PRTSR11) HSELx Protected Region Top Position */
#define MATRIX_PRTSR11_PRTOP2_Msk             (_U_(0xF) << MATRIX_PRTSR11_PRTOP2_Pos)              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR11_PRTOP2(value)          (MATRIX_PRTSR11_PRTOP2_Msk & ((value) << MATRIX_PRTSR11_PRTOP2_Pos))
#define MATRIX_PRTSR11_PRTOP3_Pos             _U_(12)                                              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Position */
#define MATRIX_PRTSR11_PRTOP3_Msk             (_U_(0xF) << MATRIX_PRTSR11_PRTOP3_Pos)              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR11_PRTOP3(value)          (MATRIX_PRTSR11_PRTOP3_Msk & ((value) << MATRIX_PRTSR11_PRTOP3_Pos))
#define MATRIX_PRTSR11_PRTOP4_Pos             _U_(16)                                              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Position */
#define MATRIX_PRTSR11_PRTOP4_Msk             (_U_(0xF) << MATRIX_PRTSR11_PRTOP4_Pos)              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR11_PRTOP4(value)          (MATRIX_PRTSR11_PRTOP4_Msk & ((value) << MATRIX_PRTSR11_PRTOP4_Pos))
#define MATRIX_PRTSR11_PRTOP5_Pos             _U_(20)                                              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Position */
#define MATRIX_PRTSR11_PRTOP5_Msk             (_U_(0xF) << MATRIX_PRTSR11_PRTOP5_Pos)              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR11_PRTOP5(value)          (MATRIX_PRTSR11_PRTOP5_Msk & ((value) << MATRIX_PRTSR11_PRTOP5_Pos))
#define MATRIX_PRTSR11_PRTOP6_Pos             _U_(24)                                              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Position */
#define MATRIX_PRTSR11_PRTOP6_Msk             (_U_(0xF) << MATRIX_PRTSR11_PRTOP6_Pos)              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR11_PRTOP6(value)          (MATRIX_PRTSR11_PRTOP6_Msk & ((value) << MATRIX_PRTSR11_PRTOP6_Pos))
#define MATRIX_PRTSR11_PRTOP7_Pos             _U_(28)                                              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Position */
#define MATRIX_PRTSR11_PRTOP7_Msk             (_U_(0xF) << MATRIX_PRTSR11_PRTOP7_Pos)              /**< (MATRIX_PRTSR11) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR11_PRTOP7(value)          (MATRIX_PRTSR11_PRTOP7_Msk & ((value) << MATRIX_PRTSR11_PRTOP7_Pos))
#define MATRIX_PRTSR11_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR11) Register Mask  */


/* -------- MATRIX_PRTSR12 : (MATRIX Offset: 0x2B0) (R/W 32) Protected Region Top Slave 0 Register 12 -------- */
#define MATRIX_PRTSR12_PRTOP0_Pos             _U_(0)                                               /**< (MATRIX_PRTSR12) HSELx Protected Region Top Position */
#define MATRIX_PRTSR12_PRTOP0_Msk             (_U_(0xF) << MATRIX_PRTSR12_PRTOP0_Pos)              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR12_PRTOP0(value)          (MATRIX_PRTSR12_PRTOP0_Msk & ((value) << MATRIX_PRTSR12_PRTOP0_Pos))
#define MATRIX_PRTSR12_PRTOP1_Pos             _U_(4)                                               /**< (MATRIX_PRTSR12) HSELx Protected Region Top Position */
#define MATRIX_PRTSR12_PRTOP1_Msk             (_U_(0xF) << MATRIX_PRTSR12_PRTOP1_Pos)              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR12_PRTOP1(value)          (MATRIX_PRTSR12_PRTOP1_Msk & ((value) << MATRIX_PRTSR12_PRTOP1_Pos))
#define MATRIX_PRTSR12_PRTOP2_Pos             _U_(8)                                               /**< (MATRIX_PRTSR12) HSELx Protected Region Top Position */
#define MATRIX_PRTSR12_PRTOP2_Msk             (_U_(0xF) << MATRIX_PRTSR12_PRTOP2_Pos)              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR12_PRTOP2(value)          (MATRIX_PRTSR12_PRTOP2_Msk & ((value) << MATRIX_PRTSR12_PRTOP2_Pos))
#define MATRIX_PRTSR12_PRTOP3_Pos             _U_(12)                                              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Position */
#define MATRIX_PRTSR12_PRTOP3_Msk             (_U_(0xF) << MATRIX_PRTSR12_PRTOP3_Pos)              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR12_PRTOP3(value)          (MATRIX_PRTSR12_PRTOP3_Msk & ((value) << MATRIX_PRTSR12_PRTOP3_Pos))
#define MATRIX_PRTSR12_PRTOP4_Pos             _U_(16)                                              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Position */
#define MATRIX_PRTSR12_PRTOP4_Msk             (_U_(0xF) << MATRIX_PRTSR12_PRTOP4_Pos)              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR12_PRTOP4(value)          (MATRIX_PRTSR12_PRTOP4_Msk & ((value) << MATRIX_PRTSR12_PRTOP4_Pos))
#define MATRIX_PRTSR12_PRTOP5_Pos             _U_(20)                                              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Position */
#define MATRIX_PRTSR12_PRTOP5_Msk             (_U_(0xF) << MATRIX_PRTSR12_PRTOP5_Pos)              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR12_PRTOP5(value)          (MATRIX_PRTSR12_PRTOP5_Msk & ((value) << MATRIX_PRTSR12_PRTOP5_Pos))
#define MATRIX_PRTSR12_PRTOP6_Pos             _U_(24)                                              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Position */
#define MATRIX_PRTSR12_PRTOP6_Msk             (_U_(0xF) << MATRIX_PRTSR12_PRTOP6_Pos)              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR12_PRTOP6(value)          (MATRIX_PRTSR12_PRTOP6_Msk & ((value) << MATRIX_PRTSR12_PRTOP6_Pos))
#define MATRIX_PRTSR12_PRTOP7_Pos             _U_(28)                                              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Position */
#define MATRIX_PRTSR12_PRTOP7_Msk             (_U_(0xF) << MATRIX_PRTSR12_PRTOP7_Pos)              /**< (MATRIX_PRTSR12) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR12_PRTOP7(value)          (MATRIX_PRTSR12_PRTOP7_Msk & ((value) << MATRIX_PRTSR12_PRTOP7_Pos))
#define MATRIX_PRTSR12_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR12) Register Mask  */


/* -------- MATRIX_PRTSR13 : (MATRIX Offset: 0x2B4) (R/W 32) Protected Region Top Slave 0 Register 13 -------- */
#define MATRIX_PRTSR13_PRTOP0_Pos             _U_(0)                                               /**< (MATRIX_PRTSR13) HSELx Protected Region Top Position */
#define MATRIX_PRTSR13_PRTOP0_Msk             (_U_(0xF) << MATRIX_PRTSR13_PRTOP0_Pos)              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR13_PRTOP0(value)          (MATRIX_PRTSR13_PRTOP0_Msk & ((value) << MATRIX_PRTSR13_PRTOP0_Pos))
#define MATRIX_PRTSR13_PRTOP1_Pos             _U_(4)                                               /**< (MATRIX_PRTSR13) HSELx Protected Region Top Position */
#define MATRIX_PRTSR13_PRTOP1_Msk             (_U_(0xF) << MATRIX_PRTSR13_PRTOP1_Pos)              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR13_PRTOP1(value)          (MATRIX_PRTSR13_PRTOP1_Msk & ((value) << MATRIX_PRTSR13_PRTOP1_Pos))
#define MATRIX_PRTSR13_PRTOP2_Pos             _U_(8)                                               /**< (MATRIX_PRTSR13) HSELx Protected Region Top Position */
#define MATRIX_PRTSR13_PRTOP2_Msk             (_U_(0xF) << MATRIX_PRTSR13_PRTOP2_Pos)              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR13_PRTOP2(value)          (MATRIX_PRTSR13_PRTOP2_Msk & ((value) << MATRIX_PRTSR13_PRTOP2_Pos))
#define MATRIX_PRTSR13_PRTOP3_Pos             _U_(12)                                              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Position */
#define MATRIX_PRTSR13_PRTOP3_Msk             (_U_(0xF) << MATRIX_PRTSR13_PRTOP3_Pos)              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR13_PRTOP3(value)          (MATRIX_PRTSR13_PRTOP3_Msk & ((value) << MATRIX_PRTSR13_PRTOP3_Pos))
#define MATRIX_PRTSR13_PRTOP4_Pos             _U_(16)                                              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Position */
#define MATRIX_PRTSR13_PRTOP4_Msk             (_U_(0xF) << MATRIX_PRTSR13_PRTOP4_Pos)              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR13_PRTOP4(value)          (MATRIX_PRTSR13_PRTOP4_Msk & ((value) << MATRIX_PRTSR13_PRTOP4_Pos))
#define MATRIX_PRTSR13_PRTOP5_Pos             _U_(20)                                              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Position */
#define MATRIX_PRTSR13_PRTOP5_Msk             (_U_(0xF) << MATRIX_PRTSR13_PRTOP5_Pos)              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR13_PRTOP5(value)          (MATRIX_PRTSR13_PRTOP5_Msk & ((value) << MATRIX_PRTSR13_PRTOP5_Pos))
#define MATRIX_PRTSR13_PRTOP6_Pos             _U_(24)                                              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Position */
#define MATRIX_PRTSR13_PRTOP6_Msk             (_U_(0xF) << MATRIX_PRTSR13_PRTOP6_Pos)              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR13_PRTOP6(value)          (MATRIX_PRTSR13_PRTOP6_Msk & ((value) << MATRIX_PRTSR13_PRTOP6_Pos))
#define MATRIX_PRTSR13_PRTOP7_Pos             _U_(28)                                              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Position */
#define MATRIX_PRTSR13_PRTOP7_Msk             (_U_(0xF) << MATRIX_PRTSR13_PRTOP7_Pos)              /**< (MATRIX_PRTSR13) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR13_PRTOP7(value)          (MATRIX_PRTSR13_PRTOP7_Msk & ((value) << MATRIX_PRTSR13_PRTOP7_Pos))
#define MATRIX_PRTSR13_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR13) Register Mask  */


/* -------- MATRIX_PRTSR14 : (MATRIX Offset: 0x2B8) (R/W 32) Protected Region Top Slave 0 Register 14 -------- */
#define MATRIX_PRTSR14_PRTOP0_Pos             _U_(0)                                               /**< (MATRIX_PRTSR14) HSELx Protected Region Top Position */
#define MATRIX_PRTSR14_PRTOP0_Msk             (_U_(0xF) << MATRIX_PRTSR14_PRTOP0_Pos)              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR14_PRTOP0(value)          (MATRIX_PRTSR14_PRTOP0_Msk & ((value) << MATRIX_PRTSR14_PRTOP0_Pos))
#define MATRIX_PRTSR14_PRTOP1_Pos             _U_(4)                                               /**< (MATRIX_PRTSR14) HSELx Protected Region Top Position */
#define MATRIX_PRTSR14_PRTOP1_Msk             (_U_(0xF) << MATRIX_PRTSR14_PRTOP1_Pos)              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR14_PRTOP1(value)          (MATRIX_PRTSR14_PRTOP1_Msk & ((value) << MATRIX_PRTSR14_PRTOP1_Pos))
#define MATRIX_PRTSR14_PRTOP2_Pos             _U_(8)                                               /**< (MATRIX_PRTSR14) HSELx Protected Region Top Position */
#define MATRIX_PRTSR14_PRTOP2_Msk             (_U_(0xF) << MATRIX_PRTSR14_PRTOP2_Pos)              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR14_PRTOP2(value)          (MATRIX_PRTSR14_PRTOP2_Msk & ((value) << MATRIX_PRTSR14_PRTOP2_Pos))
#define MATRIX_PRTSR14_PRTOP3_Pos             _U_(12)                                              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Position */
#define MATRIX_PRTSR14_PRTOP3_Msk             (_U_(0xF) << MATRIX_PRTSR14_PRTOP3_Pos)              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR14_PRTOP3(value)          (MATRIX_PRTSR14_PRTOP3_Msk & ((value) << MATRIX_PRTSR14_PRTOP3_Pos))
#define MATRIX_PRTSR14_PRTOP4_Pos             _U_(16)                                              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Position */
#define MATRIX_PRTSR14_PRTOP4_Msk             (_U_(0xF) << MATRIX_PRTSR14_PRTOP4_Pos)              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR14_PRTOP4(value)          (MATRIX_PRTSR14_PRTOP4_Msk & ((value) << MATRIX_PRTSR14_PRTOP4_Pos))
#define MATRIX_PRTSR14_PRTOP5_Pos             _U_(20)                                              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Position */
#define MATRIX_PRTSR14_PRTOP5_Msk             (_U_(0xF) << MATRIX_PRTSR14_PRTOP5_Pos)              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR14_PRTOP5(value)          (MATRIX_PRTSR14_PRTOP5_Msk & ((value) << MATRIX_PRTSR14_PRTOP5_Pos))
#define MATRIX_PRTSR14_PRTOP6_Pos             _U_(24)                                              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Position */
#define MATRIX_PRTSR14_PRTOP6_Msk             (_U_(0xF) << MATRIX_PRTSR14_PRTOP6_Pos)              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR14_PRTOP6(value)          (MATRIX_PRTSR14_PRTOP6_Msk & ((value) << MATRIX_PRTSR14_PRTOP6_Pos))
#define MATRIX_PRTSR14_PRTOP7_Pos             _U_(28)                                              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Position */
#define MATRIX_PRTSR14_PRTOP7_Msk             (_U_(0xF) << MATRIX_PRTSR14_PRTOP7_Pos)              /**< (MATRIX_PRTSR14) HSELx Protected Region Top Mask */
#define MATRIX_PRTSR14_PRTOP7(value)          (MATRIX_PRTSR14_PRTOP7_Msk & ((value) << MATRIX_PRTSR14_PRTOP7_Pos))
#define MATRIX_PRTSR14_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PRTSR14) Register Mask  */


