Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
/* -------- MATRIX_PPSELR1 : (MATRIX Offset: 0x2C4) (R/W 32) Protected Peripheral Select 1 Register 1 -------- */
#define MATRIX_PPSELR1_USERP0_Pos             _U_(0)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP0_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP0_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP0(value)          (MATRIX_PPSELR1_USERP0_Msk & ((value) << MATRIX_PPSELR1_USERP0_Pos))
#define MATRIX_PPSELR1_USERP1_Pos             _U_(1)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP1_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP1_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP1(value)          (MATRIX_PPSELR1_USERP1_Msk & ((value) << MATRIX_PPSELR1_USERP1_Pos))
#define MATRIX_PPSELR1_USERP2_Pos             _U_(2)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP2_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP2_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP2(value)          (MATRIX_PPSELR1_USERP2_Msk & ((value) << MATRIX_PPSELR1_USERP2_Pos))
#define MATRIX_PPSELR1_USERP3_Pos             _U_(3)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP3_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP3_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP3(value)          (MATRIX_PPSELR1_USERP3_Msk & ((value) << MATRIX_PPSELR1_USERP3_Pos))
#define MATRIX_PPSELR1_USERP4_Pos             _U_(4)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP4_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP4_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP4(value)          (MATRIX_PPSELR1_USERP4_Msk & ((value) << MATRIX_PPSELR1_USERP4_Pos))
#define MATRIX_PPSELR1_USERP5_Pos             _U_(5)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP5_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP5_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP5(value)          (MATRIX_PPSELR1_USERP5_Msk & ((value) << MATRIX_PPSELR1_USERP5_Pos))
#define MATRIX_PPSELR1_USERP6_Pos             _U_(6)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP6_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP6_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP6(value)          (MATRIX_PPSELR1_USERP6_Msk & ((value) << MATRIX_PPSELR1_USERP6_Pos))
#define MATRIX_PPSELR1_USERP7_Pos             _U_(7)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP7_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP7_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP7(value)          (MATRIX_PPSELR1_USERP7_Msk & ((value) << MATRIX_PPSELR1_USERP7_Pos))
#define MATRIX_PPSELR1_USERP8_Pos             _U_(8)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP8_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP8_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP8(value)          (MATRIX_PPSELR1_USERP8_Msk & ((value) << MATRIX_PPSELR1_USERP8_Pos))
#define MATRIX_PPSELR1_USERP9_Pos             _U_(9)                                               /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP9_Msk             (_U_(0x1) << MATRIX_PPSELR1_USERP9_Pos)              /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP9(value)          (MATRIX_PPSELR1_USERP9_Msk & ((value) << MATRIX_PPSELR1_USERP9_Pos))
#define MATRIX_PPSELR1_USERP10_Pos            _U_(10)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP10_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP10_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP10(value)         (MATRIX_PPSELR1_USERP10_Msk & ((value) << MATRIX_PPSELR1_USERP10_Pos))
#define MATRIX_PPSELR1_USERP11_Pos            _U_(11)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP11_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP11_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP11(value)         (MATRIX_PPSELR1_USERP11_Msk & ((value) << MATRIX_PPSELR1_USERP11_Pos))
#define MATRIX_PPSELR1_USERP12_Pos            _U_(12)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP12_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP12_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP12(value)         (MATRIX_PPSELR1_USERP12_Msk & ((value) << MATRIX_PPSELR1_USERP12_Pos))
#define MATRIX_PPSELR1_USERP13_Pos            _U_(13)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP13_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP13_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP13(value)         (MATRIX_PPSELR1_USERP13_Msk & ((value) << MATRIX_PPSELR1_USERP13_Pos))
#define MATRIX_PPSELR1_USERP14_Pos            _U_(14)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP14_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP14_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP14(value)         (MATRIX_PPSELR1_USERP14_Msk & ((value) << MATRIX_PPSELR1_USERP14_Pos))
#define MATRIX_PPSELR1_USERP15_Pos            _U_(15)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP15_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP15_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP15(value)         (MATRIX_PPSELR1_USERP15_Msk & ((value) << MATRIX_PPSELR1_USERP15_Pos))
#define MATRIX_PPSELR1_USERP16_Pos            _U_(16)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP16_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP16_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP16(value)         (MATRIX_PPSELR1_USERP16_Msk & ((value) << MATRIX_PPSELR1_USERP16_Pos))
#define MATRIX_PPSELR1_USERP17_Pos            _U_(17)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP17_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP17_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP17(value)         (MATRIX_PPSELR1_USERP17_Msk & ((value) << MATRIX_PPSELR1_USERP17_Pos))
#define MATRIX_PPSELR1_USERP18_Pos            _U_(18)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP18_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP18_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP18(value)         (MATRIX_PPSELR1_USERP18_Msk & ((value) << MATRIX_PPSELR1_USERP18_Pos))
#define MATRIX_PPSELR1_USERP19_Pos            _U_(19)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP19_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP19_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP19(value)         (MATRIX_PPSELR1_USERP19_Msk & ((value) << MATRIX_PPSELR1_USERP19_Pos))
#define MATRIX_PPSELR1_USERP20_Pos            _U_(20)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP20_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP20_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP20(value)         (MATRIX_PPSELR1_USERP20_Msk & ((value) << MATRIX_PPSELR1_USERP20_Pos))
#define MATRIX_PPSELR1_USERP21_Pos            _U_(21)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP21_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP21_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP21(value)         (MATRIX_PPSELR1_USERP21_Msk & ((value) << MATRIX_PPSELR1_USERP21_Pos))
#define MATRIX_PPSELR1_USERP22_Pos            _U_(22)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP22_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP22_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP22(value)         (MATRIX_PPSELR1_USERP22_Msk & ((value) << MATRIX_PPSELR1_USERP22_Pos))
#define MATRIX_PPSELR1_USERP23_Pos            _U_(23)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP23_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP23_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP23(value)         (MATRIX_PPSELR1_USERP23_Msk & ((value) << MATRIX_PPSELR1_USERP23_Pos))
#define MATRIX_PPSELR1_USERP24_Pos            _U_(24)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP24_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP24_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP24(value)         (MATRIX_PPSELR1_USERP24_Msk & ((value) << MATRIX_PPSELR1_USERP24_Pos))
#define MATRIX_PPSELR1_USERP25_Pos            _U_(25)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP25_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP25_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP25(value)         (MATRIX_PPSELR1_USERP25_Msk & ((value) << MATRIX_PPSELR1_USERP25_Pos))
#define MATRIX_PPSELR1_USERP26_Pos            _U_(26)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP26_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP26_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP26(value)         (MATRIX_PPSELR1_USERP26_Msk & ((value) << MATRIX_PPSELR1_USERP26_Pos))
#define MATRIX_PPSELR1_USERP27_Pos            _U_(27)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP27_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP27_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP27(value)         (MATRIX_PPSELR1_USERP27_Msk & ((value) << MATRIX_PPSELR1_USERP27_Pos))
#define MATRIX_PPSELR1_USERP28_Pos            _U_(28)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP28_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP28_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP28(value)         (MATRIX_PPSELR1_USERP28_Msk & ((value) << MATRIX_PPSELR1_USERP28_Pos))
#define MATRIX_PPSELR1_USERP29_Pos            _U_(29)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP29_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP29_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP29(value)         (MATRIX_PPSELR1_USERP29_Msk & ((value) << MATRIX_PPSELR1_USERP29_Pos))
#define MATRIX_PPSELR1_USERP30_Pos            _U_(30)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP30_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP30_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP30(value)         (MATRIX_PPSELR1_USERP30_Msk & ((value) << MATRIX_PPSELR1_USERP30_Pos))
#define MATRIX_PPSELR1_USERP31_Pos            _U_(31)                                              /**< (MATRIX_PPSELR1) User PSELy Peripheral Position */
#define MATRIX_PPSELR1_USERP31_Msk            (_U_(0x1) << MATRIX_PPSELR1_USERP31_Pos)             /**< (MATRIX_PPSELR1) User PSELy Peripheral Mask */
#define MATRIX_PPSELR1_USERP31(value)         (MATRIX_PPSELR1_USERP31_Msk & ((value) << MATRIX_PPSELR1_USERP31_Pos))
#define MATRIX_PPSELR1_Msk                    _U_(0xFFFFFFFF)                                      /**< (MATRIX_PPSELR1) Register Mask  */

#define MATRIX_PPSELR1_USERP_Pos              _U_(0)                                               /**< (MATRIX_PPSELR1 Position) User PSELy Peripheral */
#define MATRIX_PPSELR1_USERP_Msk              (_U_(0xFFFFFFFF) << MATRIX_PPSELR1_USERP_Pos)        /**< (MATRIX_PPSELR1 Mask) USERP */
#define MATRIX_PPSELR1_USERP(value)           (MATRIX_PPSELR1_USERP_Msk & ((value) << MATRIX_PPSELR1_USERP_Pos)) 

