Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/matrix.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief MATRIX register API structure */
typedef struct
{
  __IO  uint32_t                       MATRIX_MCFG0;       /**< Offset: 0x00 (R/W  32) Master Configuration Register 0 */
  __IO  uint32_t                       MATRIX_MCFG1;       /**< Offset: 0x04 (R/W  32) Master Configuration Register 1 */
  __IO  uint32_t                       MATRIX_MCFG2;       /**< Offset: 0x08 (R/W  32) Master Configuration Register 2 */
  __IO  uint32_t                       MATRIX_MCFG3;       /**< Offset: 0x0C (R/W  32) Master Configuration Register 3 */
  __IO  uint32_t                       MATRIX_MCFG4;       /**< Offset: 0x10 (R/W  32) Master Configuration Register 4 */
  __IO  uint32_t                       MATRIX_MCFG5;       /**< Offset: 0x14 (R/W  32) Master Configuration Register 5 */
  __IO  uint32_t                       MATRIX_MCFG6;       /**< Offset: 0x18 (R/W  32) Master Configuration Register 6 */
  __IO  uint32_t                       MATRIX_MCFG7;       /**< Offset: 0x1C (R/W  32) Master Configuration Register 7 */
  __IO  uint32_t                       MATRIX_MCFG8;       /**< Offset: 0x20 (R/W  32) Master Configuration Register 8 */
  __IO  uint32_t                       MATRIX_MCFG9;       /**< Offset: 0x24 (R/W  32) Master Configuration Register 9 */
  __IO  uint32_t                       MATRIX_MCFG10;      /**< Offset: 0x28 (R/W  32) Master Configuration Register 10 */
  __IO  uint32_t                       MATRIX_MCFG11;      /**< Offset: 0x2C (R/W  32) Master Configuration Register 11 */
  __IO  uint32_t                       MATRIX_MCFG12;      /**< Offset: 0x30 (R/W  32) Master Configuration Register 12 */
  __IO  uint32_t                       MATRIX_MCFG13;      /**< Offset: 0x34 (R/W  32) Master Configuration Register 13 */
  __IO  uint32_t                       MATRIX_MCFG14;      /**< Offset: 0x38 (R/W  32) Master Configuration Register 14 */
  __IO  uint32_t                       MATRIX_MCFG15;      /**< Offset: 0x3C (R/W  32) Master Configuration Register 15 */
  __IO  uint32_t                       MATRIX_SCFG0;       /**< Offset: 0x40 (R/W  32) Slave Configuration Register 0 */
  __IO  uint32_t                       MATRIX_SCFG1;       /**< Offset: 0x44 (R/W  32) Slave Configuration Register 1 */
  __IO  uint32_t                       MATRIX_SCFG2;       /**< Offset: 0x48 (R/W  32) Slave Configuration Register 2 */
  __IO  uint32_t                       MATRIX_SCFG3;       /**< Offset: 0x4C (R/W  32) Slave Configuration Register 3 */
  __IO  uint32_t                       MATRIX_SCFG4;       /**< Offset: 0x50 (R/W  32) Slave Configuration Register 4 */
  __IO  uint32_t                       MATRIX_SCFG5;       /**< Offset: 0x54 (R/W  32) Slave Configuration Register 5 */
  __IO  uint32_t                       MATRIX_SCFG6;       /**< Offset: 0x58 (R/W  32) Slave Configuration Register 6 */
  __IO  uint32_t                       MATRIX_SCFG7;       /**< Offset: 0x5C (R/W  32) Slave Configuration Register 7 */
  __IO  uint32_t                       MATRIX_SCFG8;       /**< Offset: 0x60 (R/W  32) Slave Configuration Register 8 */
  __IO  uint32_t                       MATRIX_SCFG9;       /**< Offset: 0x64 (R/W  32) Slave Configuration Register 9 */
  __IO  uint32_t                       MATRIX_SCFG10;      /**< Offset: 0x68 (R/W  32) Slave Configuration Register 10 */
  __IO  uint32_t                       MATRIX_SCFG11;      /**< Offset: 0x6C (R/W  32) Slave Configuration Register 11 */
  __IO  uint32_t                       MATRIX_SCFG12;      /**< Offset: 0x70 (R/W  32) Slave Configuration Register 12 */
  __IO  uint32_t                       MATRIX_SCFG13;      /**< Offset: 0x74 (R/W  32) Slave Configuration Register 13 */
  __IO  uint32_t                       MATRIX_SCFG14;      /**< Offset: 0x78 (R/W  32) Slave Configuration Register 14 */
  __IO  uint32_t                       MATRIX_SCFG15;      /**< Offset: 0x7C (R/W  32) Slave Configuration Register 15 */
  __IO  uint32_t                       MATRIX_PRAS0;       /**< Offset: 0x80 (R/W  32) Priority Register A for Slave 0 */
  __IO  uint32_t                       MATRIX_PRBS0;       /**< Offset: 0x84 (R/W  32) Priority Register B for Slave 0 */
  __IO  uint32_t                       MATRIX_PRAS1;       /**< Offset: 0x88 (R/W  32) Priority Register A for Slave 1 */
  __IO  uint32_t                       MATRIX_PRBS1;       /**< Offset: 0x8C (R/W  32) Priority Register B for Slave 1 */
  __IO  uint32_t                       MATRIX_PRAS2;       /**< Offset: 0x90 (R/W  32) Priority Register A for Slave 2 */
  __IO  uint32_t                       MATRIX_PRBS2;       /**< Offset: 0x94 (R/W  32) Priority Register B for Slave 2 */
  __IO  uint32_t                       MATRIX_PRAS3;       /**< Offset: 0x98 (R/W  32) Priority Register A for Slave 3 */
  __IO  uint32_t                       MATRIX_PRBS3;       /**< Offset: 0x9C (R/W  32) Priority Register B for Slave 3 */
  __IO  uint32_t                       MATRIX_PRAS4;       /**< Offset: 0xA0 (R/W  32) Priority Register A for Slave 4 */
  __IO  uint32_t                       MATRIX_PRBS4;       /**< Offset: 0xA4 (R/W  32) Priority Register B for Slave 4 */
  __IO  uint32_t                       MATRIX_PRAS5;       /**< Offset: 0xA8 (R/W  32) Priority Register A for Slave 5 */
  __IO  uint32_t                       MATRIX_PRBS5;       /**< Offset: 0xAC (R/W  32) Priority Register B for Slave 5 */
  __IO  uint32_t                       MATRIX_PRAS6;       /**< Offset: 0xB0 (R/W  32) Priority Register A for Slave 6 */
  __IO  uint32_t                       MATRIX_PRBS6;       /**< Offset: 0xB4 (R/W  32) Priority Register B for Slave 6 */
  __IO  uint32_t                       MATRIX_PRAS7;       /**< Offset: 0xB8 (R/W  32) Priority Register A for Slave 7 */
  __IO  uint32_t                       MATRIX_PRBS7;       /**< Offset: 0xBC (R/W  32) Priority Register B for Slave 7 */
  __IO  uint32_t                       MATRIX_PRAS8;       /**< Offset: 0xC0 (R/W  32) Priority Register A for Slave 8 */
  __IO  uint32_t                       MATRIX_PRBS8;       /**< Offset: 0xC4 (R/W  32) Priority Register B for Slave 8 */
  __IO  uint32_t                       MATRIX_PRAS9;       /**< Offset: 0xC8 (R/W  32) Priority Register A for Slave 9 */
  __IO  uint32_t                       MATRIX_PRBS9;       /**< Offset: 0xCC (R/W  32) Priority Register B for Slave 9 */
  __IO  uint32_t                       MATRIX_PRAS10;      /**< Offset: 0xD0 (R/W  32) Priority Register A for Slave 10 */
  __IO  uint32_t                       MATRIX_PRBS10;      /**< Offset: 0xD4 (R/W  32) Priority Register B for Slave 10 */
  __IO  uint32_t                       MATRIX_PRAS11;      /**< Offset: 0xD8 (R/W  32) Priority Register A for Slave 11 */
  __IO  uint32_t                       MATRIX_PRBS11;      /**< Offset: 0xDC (R/W  32) Priority Register B for Slave 11 */
  __IO  uint32_t                       MATRIX_PRAS12;      /**< Offset: 0xE0 (R/W  32) Priority Register A for Slave 12 */
  __IO  uint32_t                       MATRIX_PRBS12;      /**< Offset: 0xE4 (R/W  32) Priority Register B for Slave 12 */
  __IO  uint32_t                       MATRIX_PRAS13;      /**< Offset: 0xE8 (R/W  32) Priority Register A for Slave 13 */
  __IO  uint32_t                       MATRIX_PRBS13;      /**< Offset: 0xEC (R/W  32) Priority Register B for Slave 13 */
  __IO  uint32_t                       MATRIX_PRAS14;      /**< Offset: 0xF0 (R/W  32) Priority Register A for Slave 14 */
  __IO  uint32_t                       MATRIX_PRBS14;      /**< Offset: 0xF4 (R/W  32) Priority Register B for Slave 14 */
  __IO  uint32_t                       MATRIX_PRAS15;      /**< Offset: 0xF8 (R/W  32) Priority Register A for Slave 15 */
  __IO  uint32_t                       MATRIX_PRBS15;      /**< Offset: 0xFC (R/W  32) Priority Register B for Slave 15 */
  __IO  uint32_t                       MATRIX_MRCR;        /**< Offset: 0x100 (R/W  32) Master Remap Control Register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       MATRIX_SFR0;        /**< Offset: 0x110 (R/W  32) Special Function Register 0 */
  __IO  uint32_t                       MATRIX_SFR1;        /**< Offset: 0x114 (R/W  32) Special Function Register 1 */
  __IO  uint32_t                       MATRIX_SFR2;        /**< Offset: 0x118 (R/W  32) Special Function Register 2 */
  __IO  uint32_t                       MATRIX_SFR3;        /**< Offset: 0x11C (R/W  32) Special Function Register 3 */
  __IO  uint32_t                       MATRIX_SFR4;        /**< Offset: 0x120 (R/W  32) Special Function Register 4 */
  __IO  uint32_t                       MATRIX_SFR5;        /**< Offset: 0x124 (R/W  32) Special Function Register 5 */
  __IO  uint32_t                       MATRIX_SFR6;        /**< Offset: 0x128 (R/W  32) Special Function Register 6 */
  __IO  uint32_t                       MATRIX_SFR7;        /**< Offset: 0x12C (R/W  32) Special Function Register 7 */
  __IO  uint32_t                       MATRIX_SFR8;        /**< Offset: 0x130 (R/W  32) Special Function Register 8 */
  __IO  uint32_t                       MATRIX_SFR9;        /**< Offset: 0x134 (R/W  32) Special Function Register 9 */
  __IO  uint32_t                       MATRIX_SFR10;       /**< Offset: 0x138 (R/W  32) Special Function Register 10 */
  __IO  uint32_t                       MATRIX_SFR11;       /**< Offset: 0x13C (R/W  32) Special Function Register 11 */
  __IO  uint32_t                       MATRIX_SFR12;       /**< Offset: 0x140 (R/W  32) Special Function Register 12 */
  __IO  uint32_t                       MATRIX_SFR13;       /**< Offset: 0x144 (R/W  32) Special Function Register 13 */
  __IO  uint32_t                       MATRIX_SFR14;       /**< Offset: 0x148 (R/W  32) Special Function Register 14 */
  __IO  uint32_t                       MATRIX_SFR15;       /**< Offset: 0x14C (R/W  32) Special Function Register 15 */
  __O   uint32_t                       MATRIX_MEIER;       /**< Offset: 0x150 ( /W  32) Master Error Interrupt Enable Register */
  __O   uint32_t                       MATRIX_MEIDR;       /**< Offset: 0x154 ( /W  32) Master Error Interrupt Disable Register */
  __I   uint32_t                       MATRIX_MEIMR;       /**< Offset: 0x158 (R/   32) Master Error Interrupt Mask Register */
  __I   uint32_t                       MATRIX_MESR;        /**< Offset: 0x15C (R/   32) Master Error Status Register */
  __I   uint32_t                       MATRIX_MEAR0;       /**< Offset: 0x160 (R/   32) Master 0 Error Address Register 0 */
  __I   uint32_t                       MATRIX_MEAR1;       /**< Offset: 0x164 (R/   32) Master 0 Error Address Register 1 */
  __I   uint32_t                       MATRIX_MEAR2;       /**< Offset: 0x168 (R/   32) Master 0 Error Address Register 2 */
  __I   uint32_t                       MATRIX_MEAR3;       /**< Offset: 0x16C (R/   32) Master 0 Error Address Register 3 */
  __I   uint32_t                       MATRIX_MEAR4;       /**< Offset: 0x170 (R/   32) Master 0 Error Address Register 4 */
  __I   uint32_t                       MATRIX_MEAR5;       /**< Offset: 0x174 (R/   32) Master 0 Error Address Register 5 */
  __I   uint32_t                       MATRIX_MEAR6;       /**< Offset: 0x178 (R/   32) Master 0 Error Address Register 6 */
  __I   uint32_t                       MATRIX_MEAR7;       /**< Offset: 0x17C (R/   32) Master 0 Error Address Register 7 */
  __I   uint32_t                       MATRIX_MEAR8;       /**< Offset: 0x180 (R/   32) Master 0 Error Address Register 8 */
  __I   uint32_t                       MATRIX_MEAR9;       /**< Offset: 0x184 (R/   32) Master 0 Error Address Register 9 */
  __I   uint32_t                       MATRIX_MEAR10;      /**< Offset: 0x188 (R/   32) Master 0 Error Address Register 10 */
  __I   uint32_t                       MATRIX_MEAR11;      /**< Offset: 0x18C (R/   32) Master 0 Error Address Register 11 */
  __I   uint32_t                       MATRIX_MEAR12;      /**< Offset: 0x190 (R/   32) Master 0 Error Address Register 12 */
  __I   uint32_t                       MATRIX_MEAR13;      /**< Offset: 0x194 (R/   32) Master 0 Error Address Register 13 */
  __I   uint32_t                       MATRIX_MEAR14;      /**< Offset: 0x198 (R/   32) Master 0 Error Address Register 14 */
  __I   uint32_t                       MATRIX_MEAR15;      /**< Offset: 0x19C (R/   32) Master 0 Error Address Register 15 */
  __I   uint8_t                        Reserved2[0x44];
  __IO  uint32_t                       MATRIX_WPMR;        /**< Offset: 0x1E4 (R/W  32) Write Protect Mode Register */
  __I   uint32_t                       MATRIX_WPSR;        /**< Offset: 0x1E8 (R/   32) Write Protect Status Register */
  __I   uint8_t                        Reserved3[0x14];
  __IO  uint32_t                       MATRIX_PSR0;        /**< Offset: 0x200 (R/W  32) Protection Slave 0 Register 0 */
  __IO  uint32_t                       MATRIX_PSR1;        /**< Offset: 0x204 (R/W  32) Protection Slave 0 Register 1 */
  __IO  uint32_t                       MATRIX_PSR2;        /**< Offset: 0x208 (R/W  32) Protection Slave 0 Register 2 */
  __IO  uint32_t                       MATRIX_PSR3;        /**< Offset: 0x20C (R/W  32) Protection Slave 0 Register 3 */
  __IO  uint32_t                       MATRIX_PSR4;        /**< Offset: 0x210 (R/W  32) Protection Slave 0 Register 4 */
  __IO  uint32_t                       MATRIX_PSR5;        /**< Offset: 0x214 (R/W  32) Protection Slave 0 Register 5 */
  __IO  uint32_t                       MATRIX_PSR6;        /**< Offset: 0x218 (R/W  32) Protection Slave 0 Register 6 */
  __IO  uint32_t                       MATRIX_PSR7;        /**< Offset: 0x21C (R/W  32) Protection Slave 0 Register 7 */
  __IO  uint32_t                       MATRIX_PSR8;        /**< Offset: 0x220 (R/W  32) Protection Slave 0 Register 8 */
  __IO  uint32_t                       MATRIX_PSR9;        /**< Offset: 0x224 (R/W  32) Protection Slave 0 Register 9 */
  __IO  uint32_t                       MATRIX_PSR10;       /**< Offset: 0x228 (R/W  32) Protection Slave 0 Register 10 */
  __IO  uint32_t                       MATRIX_PSR11;       /**< Offset: 0x22C (R/W  32) Protection Slave 0 Register 11 */
  __IO  uint32_t                       MATRIX_PSR12;       /**< Offset: 0x230 (R/W  32) Protection Slave 0 Register 12 */
  __IO  uint32_t                       MATRIX_PSR13;       /**< Offset: 0x234 (R/W  32) Protection Slave 0 Register 13 */
  __IO  uint32_t                       MATRIX_PSR14;       /**< Offset: 0x238 (R/W  32) Protection Slave 0 Register 14 */
  __IO  uint32_t                       MATRIX_PSR15;       /**< Offset: 0x23C (R/W  32) Protection Slave 0 Register 15 */
  __IO  uint32_t                       MATRIX_PASSR0;      /**< Offset: 0x240 (R/W  32) Protected Areas Split Slave 0 Register 0 */
  __IO  uint32_t                       MATRIX_PASSR1;      /**< Offset: 0x244 (R/W  32) Protected Areas Split Slave 0 Register 1 */
  __IO  uint32_t                       MATRIX_PASSR2;      /**< Offset: 0x248 (R/W  32) Protected Areas Split Slave 0 Register 2 */
  __IO  uint32_t                       MATRIX_PASSR3;      /**< Offset: 0x24C (R/W  32) Protected Areas Split Slave 0 Register 3 */
  __IO  uint32_t                       MATRIX_PASSR4;      /**< Offset: 0x250 (R/W  32) Protected Areas Split Slave 0 Register 4 */
  __IO  uint32_t                       MATRIX_PASSR5;      /**< Offset: 0x254 (R/W  32) Protected Areas Split Slave 0 Register 5 */
  __IO  uint32_t                       MATRIX_PASSR6;      /**< Offset: 0x258 (R/W  32) Protected Areas Split Slave 0 Register 6 */
  __IO  uint32_t                       MATRIX_PASSR7;      /**< Offset: 0x25C (R/W  32) Protected Areas Split Slave 0 Register 7 */
  __IO  uint32_t                       MATRIX_PASSR8;      /**< Offset: 0x260 (R/W  32) Protected Areas Split Slave 0 Register 8 */
  __IO  uint32_t                       MATRIX_PASSR9;      /**< Offset: 0x264 (R/W  32) Protected Areas Split Slave 0 Register 9 */
  __IO  uint32_t                       MATRIX_PASSR10;     /**< Offset: 0x268 (R/W  32) Protected Areas Split Slave 0 Register 10 */
  __IO  uint32_t                       MATRIX_PASSR11;     /**< Offset: 0x26C (R/W  32) Protected Areas Split Slave 0 Register 11 */
  __IO  uint32_t                       MATRIX_PASSR12;     /**< Offset: 0x270 (R/W  32) Protected Areas Split Slave 0 Register 12 */
  __IO  uint32_t                       MATRIX_PASSR13;     /**< Offset: 0x274 (R/W  32) Protected Areas Split Slave 0 Register 13 */
  __IO  uint32_t                       MATRIX_PASSR14;     /**< Offset: 0x278 (R/W  32) Protected Areas Split Slave 0 Register 14 */
  __IO  uint32_t                       MATRIX_PASSR15;     /**< Offset: 0x27C (R/W  32) Protected Areas Split Slave 0 Register 15 */
  __IO  uint32_t                       MATRIX_PRTSR0;      /**< Offset: 0x280 (R/W  32) Protected Region Top Slave 0 Register 0 */
  __IO  uint32_t                       MATRIX_PRTSR1;      /**< Offset: 0x284 (R/W  32) Protected Region Top Slave 0 Register 1 */
  __IO  uint32_t                       MATRIX_PRTSR2;      /**< Offset: 0x288 (R/W  32) Protected Region Top Slave 0 Register 2 */
  __IO  uint32_t                       MATRIX_PRTSR3;      /**< Offset: 0x28C (R/W  32) Protected Region Top Slave 0 Register 3 */
  __IO  uint32_t                       MATRIX_PRTSR4;      /**< Offset: 0x290 (R/W  32) Protected Region Top Slave 0 Register 4 */
  __IO  uint32_t                       MATRIX_PRTSR5;      /**< Offset: 0x294 (R/W  32) Protected Region Top Slave 0 Register 5 */
  __IO  uint32_t                       MATRIX_PRTSR6;      /**< Offset: 0x298 (R/W  32) Protected Region Top Slave 0 Register 6 */
  __IO  uint32_t                       MATRIX_PRTSR7;      /**< Offset: 0x29C (R/W  32) Protected Region Top Slave 0 Register 7 */
  __IO  uint32_t                       MATRIX_PRTSR8;      /**< Offset: 0x2A0 (R/W  32) Protected Region Top Slave 0 Register 8 */
  __IO  uint32_t                       MATRIX_PRTSR9;      /**< Offset: 0x2A4 (R/W  32) Protected Region Top Slave 0 Register 9 */
  __IO  uint32_t                       MATRIX_PRTSR10;     /**< Offset: 0x2A8 (R/W  32) Protected Region Top Slave 0 Register 10 */
  __IO  uint32_t                       MATRIX_PRTSR11;     /**< Offset: 0x2AC (R/W  32) Protected Region Top Slave 0 Register 11 */
  __IO  uint32_t                       MATRIX_PRTSR12;     /**< Offset: 0x2B0 (R/W  32) Protected Region Top Slave 0 Register 12 */
  __IO  uint32_t                       MATRIX_PRTSR13;     /**< Offset: 0x2B4 (R/W  32) Protected Region Top Slave 0 Register 13 */
  __IO  uint32_t                       MATRIX_PRTSR14;     /**< Offset: 0x2B8 (R/W  32) Protected Region Top Slave 0 Register 14 */
  __IO  uint32_t                       MATRIX_PRTSR15;     /**< Offset: 0x2BC (R/W  32) Protected Region Top Slave 0 Register 15 */
  __IO  uint32_t                       MATRIX_PPSELR0;     /**< Offset: 0x2C0 (R/W  32) Protected Peripheral Select 1 Register 0 */
  __IO  uint32_t                       MATRIX_PPSELR1;     /**< Offset: 0x2C4 (R/W  32) Protected Peripheral Select 1 Register 1 */
  __IO  uint32_t                       MATRIX_PPSELR2;     /**< Offset: 0x2C8 (R/W  32) Protected Peripheral Select 1 Register 2 */
} matrix_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_MATRIX_COMPONENT_H_ */
